[{"id":"7-brief-lessons-on-physics","title":"7 Brief Lessons on Physics","author":"Carlo Rovelli","date":"yyyy-mm-dd","stars":"4","isbn":"9780399184437","content":"\n### Most beautiful Theory\n- Einstein discovered that the gravitational field IS the space Newton talked about\n- Cosmic background radiation from the big bang (explosion of a small overheated universe that made our large ever expanding one) is proof of the big bang\n \n### Quanta\n- The idea of light as photons (packets of energy)\n- Werner Heisenberg devised the idea that electrons only exist when being interacted with, and that when not so, they are simply a calculable probability, this helped with the quantum leap theory/idea\n- Quantum mechanics is using the idea that no object has a definite position unless colliding with something else\n- To this day we cannot prove why this theory holds, we just accept that reality only occurs in interesting\n \n### Architecture of the Cosmos\n- Corpernicus proved the earth wasn't the centre of everything \n- The universe began as a small ball and exploded into its current cosmic dimensions\n- There are billions of planets out there just like Earth, as our galaxy is one of billions\n- A grain of sand on a beach has more significance than our galaxy in the universe\n \n### Particles\n- Quarks are glued together by gluons to make protons and neutrons\n- Electrons quarks photons and gluons are the elementary particles that make up everything around us, they fluctuate between existence and non existence according to quantum theory\n- \"Standard model of elementary particles\"\n- There is a large cloud of dark matter surrounding every galaxy\n- Dark matter is just something we know is there but don't know what it is, and the standard model doesn't explain it\n \n### Loop Quantum Gravity Theory\n- Quantum mechanics and general relativity conflict each other but are both such good theories \n- Loop quantum gravity theory says that space is made up of minute particles (atoms of space) that link together to give the texture of space\n- The atoms of space are not in space because they are space\n- This theory does not include time, everything moves on its own time scale and there is no universal passing of time\n- A black hole is a rebounding Planck star that is expanding in extreme slow motion, if you were on the star of would seem fast as the lack of gravity speeds up time\n- This theory says that the big bang was actually a bounce outward following a previous universe collapsing in on itself like a black hole for universes\n \n### Probability, Time and The Heat of Black Holes\n- Heat is atoms vibrating more quickly \n- Heat proves that time exists, without friction (heat transfer) a pendulum would fluctuate forever and if you played it in reverse would seem the same, but with friction you can tell the future (small fluctuations) from the past (larger fluctuations)\n- Boltzmann discovered that heat moves from hot to cold due to probability. It is much more likely a fast vibrating particle hits a still one than vise versa, and due to the conservation of energy it gives energy to the still one\n- We don't know how gravitational field are affected by heat. How does space-time change with heat? It must vibrate but what does vibrating time look like\n- We do not say that things not 'here' don't exist so why do we say things not 'now' don't exist? This confuses physicists\n- Hawking proved black holes are always hot using quantum mechanics\n- His theory combines all 3 main physics approaches, quantum mechanics, general relativity and thermodynamics\n \n### Ourselves \n- \"Integrated information theory\" - theory about the structure of a system that makes it concious. What changes when we sleep etc\n- To be free means to make decisions based on what's going on in your mind. Not externally \n- \"Homo\" species are characterised by being curious (humans, chimps, Neanderthals)\n\n"},{"id":"barbarian-days","title":"Barbarian Days","author":"William Finnegan","date":"2023-05-22","stars":"5","isbn":"9781594203473","content":"\nI really enjoyed this book. It fills you with a sense of child-like adventure. Finnegan spent his life scratching his itch for surfing. Chasing the best waves in the world. Along the way its clear he kept detailed journals. Because the depth he goes into when telling stories from his childhood and young adult years is what makes the book so great. It's an autiobiography, but the quality of the storytelling lends an element of fiction to it as well (as with all good biographies). \n\nFinnegan grew up in California but the family moved to Hawaii at a young age. Both great surfing destinations of course, and Hawaii seems to be the place that he really came into his own as an independent surfer. After leaving school and being in and out of university, he set off on a mission to circumnavigate the world, chasing the globes best waves with a friend of his, Bryan. After about 2 years of doing exactly that, he settled down in South Africa for a while to teach at a school and surf some of the local waves. Eventually he moved back home to California where he tells stories of the undergroud surfing scene there that most are unaware of. The book finishes up with him in New York, writing full time as a journalist and often running off to New York's (much colder) waves.\n\nThroughout the book a few things stick out.\n\n**A \"way of life\"**: The love of surfing has been a rare constant throughout his life. Over 40 years since starting, he will still drop what he is doing at a moment's notice and run off with a wetsuit to catch a wave in the freezing cold seas of New York. It really makes you want to find your own passion, whatever your own version of surfing is. \n\n**Risking it all for a wave**: Along a similar vein, the risks of injury that himself and his friends often took is impressive. A lifelong passion yes. But never anything more than the next wave. Surfers dont look at the sport as a whole very often. Instead they think \"is it worth it for this wave?\". The answer is almost always yes.\n\n**Surfing friendships**: Finnegan made new friends through surfing from the age of 14 all the way through to 40. Never short of a kind person to share the sport with.\n\n**Growth through travel**: By meeting new people and seeing new cultures, he clearly developed a new way of looking at the world. A more complete one. In moving to Hawaii with his family he had left western culture. And travelling in his 20s simply continued to widen his perspective. \n\n**Always writing**: This may not surprise many people, but as a budding writer and journalist he was always writing. Journals for his personal use. Articles for travel and surf magazines. A novel of his own. This shouldn't surprise that many, but it's worth noting that, as usual, the best way to do what you want to do professionally is to do a shit-load of it non-professionally first. There's rarely a short cut. \n\n\n"},{"id":"the-proud-highway","title":"The Proud Highway","author":"Hunter S Thompson","date":"2023-04-11","stars":"5","isbn":"9781408822937","content":"I really enjoyed this. Thompson is a breath of fresh air and this comes through nowhere more clearly than in his letters. It's rare that the history of someones writing is documented so well from the early years of their life (this book starts with letters he wrote at 17, and ends in his 30s).\n\nIt's certainly not the perfect example of how to live. He continued to make the same mistakes many times, and made a lot of decisions that happened to work out for him but probably wouldn't in most cases. \n\nThat being said, it is certainly a lesson in living. You can't help but be inspired to do something more outrageous and different in your life as a result of reading the views of this man. \n\nFavourite quotes below:\n\n# Work\n- \"Gonzo, he wrote, “is a style of ‘reporting based on William Faulkner’s idea that the best fiction is far more true than any kind of journalism\"\n- \"Also, without the slightest exaggeration, I drink approximately 20 cups of coffee every 24 hours and manage to sleep about 5 hours a night.\"\n- \"Instead of battling my environment, I enjoy my work tremendously and put in about 15 hours a day at it—for the simple reason that I like to write.\"\n- \"I just keep wandering around, doing all these things and not worrying about what the results will be. So far it’s turned out pretty well.\"\n- \"I shall slave like an animal until my present run of good fortune and luck runs on the rocks. It seems impossible that it could be a lasting thing.\"\n- \"Keep in mind that the ability to create is an integral part of the makeup of man.\"\n- \"The pay is miserable, of course, but the work might be interesting.\"\n- \"Thompson polished his writing skills by typing The Great Gatsby and A Farewell to Arms in their entirety, closely studying their sentence structures.\" - *Focused hard worker*\n- \"Needless to say, I do not seek a job, but rather a position or a connection. Nor do I particularly seek money, except in the form of having my expenses covered in what I undertake\"\n- \"I am half mad from the silence I have imposed upon myself in Woody Creek, and when I find myself among human beings I tend to explode.\"\n- \"Whether you are a journalist or not, the only way to attempt journalism is to assume you know nothing at the start, and then only write what you find evidence to support\"\n- \"Right now I should be writing my new “column” in Ramparts, but I can’t get up the zap for it.\" -*Proof he never works, just does what he loves and gets paid for it*\n\n# Life Experience\n- \"Who is the happier man, he who has braved the storm of life and lived, or he who has stayed securely on shore and merely existed?\"\n- \"Has he any self-respect or pride in himself? How could he, when he has risked nothing and gained nothing?\"\n- \"How does he feel when he realizes that he has barely tasted the meal of life; when he sees the prison he has made for himself in pursuit of the almighty dollar?\"\n- \"A man is to be pitied who lacked the courage to accept the challenge of freedom and depart from the cushion of security and see life as it is in stead of living it second-hand.\"\n- \"These are the insignificant and forgotten men who preach conformity because it is all they know.\"\n- \"who is the happier man, he who has braved the storm of life and lived or he who has stayed securely on shore and merely existed?\"\n- \"You’ve lived a relatively narrow life, a vertical rather than a horizontal existence.\" - *Explore vs exploit*\n- \"I’ll stop trying to convince myself that I can’t fail: how dull the whole thing would be if that were true.\"\n- \"the most overriding of all human desires is the need to amount to something.\"\n- \"If only for an instant, the image of the man is imposed on the chaotic mainstream of life and it remains there forever:\"\n- \"I’ve learned the difference by now between a good and a bad risk.\"\n- \"Let’s face it: any man who really wants to work for Burdorf Furniture—or its equivalent—for the rest of his life is bound to be crazy—or a terribly narrow-minded coward.\"\n- \"get old gracefully—not like a boob, but like a champion.\"\n- \"I’ll go as far as the rides take me, sleep on the beach (sleeping bag), and beg, if necessary, for food.\"\n- \"Never crusading for their ideas, but doing their utmost to put them into practice\" - *Live dont preach*\n- \"What the fuck have you done except get rich?\"\n- \"Let’s face it—it’s the tension of life that keeps the light in a man’s eyes, and keeps the foam in his nuts. It’s really the only thing you can’t afford to lose.\"\n- \"But it took me six months, on horses, boats, jeeps and bush planes, to get from New York to Rio. And believe me, there is a difference.\"\n- \"**There is an amazing amount of resentment, among aging hacks, toward a young hotshot trying to bypass the bullshit jobs that none of them could avoid.**\"\n- \"I’m beginning to feel the old action mania, the compulsion to get where things are happening.\"\n- \"Now I shoot clay pigeons off the porch. And I do a lot of wood-work — shelves, walls, etc.\" - *Hobbies*\n\n# Individuailty\n- \"A man who lacks the ability to think for himself is as useless as a dead toad, while the thinking man has all the powers of the universe at his command.\"\n- \"Loneliness is for people who can’t see themselves except through the eyes of their compatriots, and all evidence points to the fact that I’ve passed that stage.\"\n- \"Anyone who doesn’t need other people to feed his ego can find privacy anywhere.\"\n- \"And indeed, that IS the question: whether to **float with the tide, or to swim for a goal**. It is a choice we must all make—consciously or unconsciously—at one time in our lives.\"\n\t- \"Existentialism: From Dostoyevsky to Sartre.\"\n\t- \"we must make the goal conform to the individual, rather than make the individual conform to the goal.\"\n\t- \"a man must choose a path which will let his ABILITIES function at maximum efficiency toward the gratification of his DESIRES.\"\n\t- \"but he has rather chosen a way of life he KNOWS he will enjoy.\"\n- \"There is plenty of money in the world but there are damn few jobs an intelligent man can do without compromising himself intolerably.\"\n- \"If you change yourself in order to be loved, then you are in love with love and not a person.\"\n- \"we are all alone, born alone, die alone,\"\n- \"I don’t see how you can respect yourself if you must look in the hearts and minds of others for your happiness.\"\n- \"To be nobody-but-yourself—in a world which is doing its best, night and day, to make you somebody else—means to fight the hardest battle which any human being can fight; and never stop fighting. * that’s e. e. cummings,\"\n- \"My position is and always has been that I distrust power and authority, together with all those who come to it by conventional means\"\n- \"nobody—despite the advertisements—has whipped up the dish you know you want to taste.\"\n- \"Most people wind up going against their instincts, and it makes them miserable for the rest of their lives.\"\n- \"I’ve also learned at least one crucially important thing since then. And that’s the idea of making your own pattern, not falling into grooves that other people made.\"\n- \"the secret of not getting caught in it is to have something of your own … some kind of skill or talent or action that other people have to respect. That way, you can ride when you want, and back off when you want.\"\n- \"**be an outlaw … but do it your own way, for your own reasons**, and for christ’s sake don’t blow it as badly as the Angels have.\"\n\n\n# Party\n- \"It should be interesting … if nothing else.\"\n- \"I’m going to need that carnival to clear my system and present plans call for me to hit the docks with one toothbrush, no extra clothes and whatever money I can scrape together. I intend to sleep on the beach (impossible to get reservations even if I could afford them) and suck up every ounce of drink I can get my hands on. I’ll probably be arrested several times, flogged by the police, and will undoubtedly have to steal a boat to get back to San Juan. I would certainly not be able to keep a steady eye on you and I know damn well that’s what I’d have to do if you were with me.\"\n- \"With the Rogue money I bought a pistol and a Doberman and a lot of whiskey,\"\n- \"I have found that most people harbor a real fear of having a little piece of lead blasted through their flesh & the drunker I get the more it amuses me.\"\n- \"If I had my way I’d be in love all the time all over the world with a rifle in one hand and a typewriter in the other and a bellyful of good whiskey.\"\n- \"Besides that, I seem to be doing everything humanly possible to finish myself with booze and general physical abuse, pills, no sleep, etc.\"\n- \"As for LSD, I highly recommend it. We had a fine, wild weekend and no trouble at all. The feeling it produces is hard to describe. “Intensity” is a fair word for it.\"\n- \"I have paid first $40 and then $50 for season tickets to the San Francisco 49er games during the past two years…\" - *Loved sports*\n\n# Writing\n- \"words are such a poor medium when you really want someone to feel something.\"\n- \"This is merely the first of a series of lectures on “subjects Thompson needs to get straight in his mind.”\"\n- \"I find that by putting things in writing I can understand them and see them a little more objectively\"\n- \"For words are merely tools and if you use the right ones you can actually put even your life in order, if you don’t lie to yourself and use the wrong words.\"\n- \"Well, this has been a good excuse for not working on the novel for an hour or so.\" - *Spent hours writing letters*\n\n# Poverty\n- \"Where I’m going to get the money to go bouncing around the country like this is a real interesting problem: but I shall find it somewhere. I’ll have to.\"\n- \"I simply have no money at all\"\n- \"At the moment I have three dollars to my name, a can of tuna fish and a can of soup in the cabin, no oil for the furnace, one bag of dried food for the dog, and about enough gas in the Jaguar to make it back to that freezing hellhole for the night.\" - *He was seriously broke*\n- \"the duffel bag and the box and the books and anything else\" - *All he owns*\n- \"I have made $630 in the past six weeks. I am so used to poverty that I can waste most of it and not know the difference.\"\n\n# Relationships\n- \"I think you should know my downs as well as my ups. The carefree Thompson facade gets very tiresome at times, and I need to have someone with whom I can be honestly confused and lost.\"\n- \"I can hardly be civil to women, and told a girl last night that if I came home with her the only act I would perform would be that of throwing her child off the cliff and into the sea.\"\n- \"send a line and say what you think. I’d really like to know how my style strikes you on various pieces.\" - *Opening a channel for relationship*\n\n# Self Belief\n- \"Perhaps I’ll try to publish my collected letters before, instead of after, I make history.\"\n- \"There is some that makes it, and some that don’t. I just happen to think I’m going to make it. I couldn’t afford to think otherwise.\"\n- \"my time is too valuable to waste in an effort to supply the “man in the street” with his daily quota of clichés, gossip, and erotic tripe.\"\n- \"If I weren’t so sure of my destiny, I might even say I was depressed.\"\n- \"I have been a smashing success at everything except earning money. At times it makes me wonder … but then, as I look down at my great heap of short story and article carbons, I know the Big Money is just around the corner. Any day now, any day now, I shall be released.\"\n- \"I have worked hard enough on it so I won’t care what anyone thinks. It is a decent chronicle of a meaningful time, and if somebody else can do it better, I am about ready to step aside anyway.\"\n- \"There’s nobody around who can do my kind of stuff, and—although a few others can do a few other things better—as a reader I’ll take mine any day.\"\n- \"There is no question that I have honed my skills to the point of unbelievable sharpness.\"\n- \"razored from beginning to end—18 pages of perfect calumny.\"\n- \"I explained that I wasn’t in the habit of settling my beefs with my fists, but with a double-barreled 12-gauge shotgun.\"\n- \"In closing, all I can say is don’t let the bastards scare you. We are tougher than they want us to think. HST\"\n\n# Books\n- \"I don’t mind giving it away, but I’d hate to see it wasted.\" - *Henry miller the world of sex*\n- \"It is a novel more gripping than The Ginger Man, more skillfully rendered than The Sergeant, more compassionate than James Agee’s A Death in the Family, and more important than Lie Down in Darkness. These, as you know, are the only good novels written in the past five years.\"\n- \"book reviews—$75 a crack, with my own choice of books. One a week keeps\" - *Book per week*\n- \"reading five or six book reviews on the subject of Kennedy.\"\n- \"By midnight I had read an entire novel and two magazines,\"\n- \"Whether it’s gratuitous or not I have to insist you read One Flew Over the Cuckoo’s Nest.\"\n- \"I wonder what you think of The Great Gatsby. If you have a moment I’d like to know. To my mind it’s the great american novel,\"\n\n\n# Discomfort\n- \"Would very much appreciate a couch at your place for maybe two days or three,\" - *Doesnt mind sleeping rough*\n- \"I got 2 hours last night, after being ejected from the whorehouse at 5:00.\" - *Sleep not most important*\n- \"it is hard to see anything when your eyes are bloodshot and your cheeks are hollow and your bowels are rotten and your head spins when you get up and your prick is falling off and you barely have the energy or even the inclination to get out of bed in the morning. That is exactly the way I feel.\"\n- \"I had a nervous collapse today—violent shouting, destruction, tears, the whole works\"\n- \"my nerves are so bad that any small thing is likely to kick me off on a rage.\" - *Lives as an open book*\n- \"I fled to the dining car for breakfast, wondering if my nerves would hold up until we got to Chicago––33 more hours.\" - *Feels stress like anyone else*\n- \"It scared me so badly that I am still afraid to drive.\" - *Honest an open*\n- \"it, along with my penicillin and Vitamin B overloads, jolted me out of the month-long sloth I’ve been in.\" - *Month long low periods*\n- \"I’ve developed such a loathing for the typewriter that I rarely even enter this room.\" - *Happens to the best of us*\n\n\n# Unseriousness\n- \"I would feel less than honest if I failed to warn you against the danger of taking yourself too seriously. It can do a man in.\"\n- \"Life has improved immeasurably since I have been forced to stop taking it seriously.\"\n- \"true anarchist is the only man who can afford to relax in this world;\"\n- \"I may even seek employment myself, but I doubt it. It would be like lopping off my balls. After five years on the fringe, I couldn’t handle anything steady.\"\n- \"when you tell me to get off to Berkeley for the sit-ins I say no thanks I think I’ll go out to the beach and run in the fog and try to stay human in the smell of my own sweat.\" - *Stay human*\n- \"willfully ignorant of all protocol and that sort of thing.\"\n- \"That includes teachers in school, sergeants in the Air Force, and cops on the highways. But people like that can screw you up pretty badly if you argue with them on their own turf,\"\n\n# Knowledge\n- \"One of the 3 big issues before this session of Congress is how to deal with the reality of an economic U.S. of Europe. Simple production figures and gross national products will tell you this.\" - *educated on main issues*\n- \"Unless the June 10 Peru elections look to be bloody, I will stay in Bogotá two weeks\" - *Follows local politics*\n- \"But first there are other things to be learned: the origins and appeal of Marxism should be near the top of the list;\" - *Thinking about the big questions*\n- \"Your mail is increasingly incoherent.\" - *Demands people have intelligent opinions*\n- \"hoping you can differentiate between a personal attack and a rhetorical judo match.\"\n- \"The worst thing about TV news is that it tends to be narrow-minded, stampeded to the obvious, the Big Story, while the meat of reality goes ignored.\"\n- \"I would advise you, if you mean to deal with the big picture, to learn as much about the big facts as possible.\"\n\n# Journalism\n- \"my name is X and I have an awful curiosity; I wonder if you’d mind giving me the inside dope.”\"\n- \"Drink with as many people as possible,\"\n- \"the oddball stuff that is really the most important.\"\n- \"In the main, I like the offbeat stuff, that’s par for my course.\"\n- \"Fiction is a bridge to the truth that journalism can’t reach.\"\n- \"Like, “What made it happen?” and “What now?” And “Why?”\" - *Questions he asks*\n"},{"id":"the-fountainhead","title":"The Fountainhead","author":"Ayn Rand","date":"2023-01-26","stars":"5","isbn":"0026009102","content":"References: Individualism | Objectivism\n\nWhat. A. Book. I've always struggled with recommending people books. Thats why I share what I myself have read instead of telling others what to read. But this book has made that question so easy to answer. It is my number one go to book to reccomend to people. It's empowering in it's idea of individuality, and motivates you to follow your own way in life as opposed to conforming into something that deep down you know you are not. \n\nHoward Roark is the main character, and exemplifies all the ideas that Rand is writing about perfectly. He would undoubtedly be the most independent person you have ever met, if you were so lucky. \n\nThe essential essence of the book is around moving society forward through individuals making completely self interested decisions about the way they think the world should be. In this case it is Roark and his modernist style of architecture. It mocks what Rand calls the 'second handers' that simply mirror the opinions of others and follow the crowd. \n\nDont be a second hander.\n\n## Highlights\n\n\"It's for four years. But, on the other hand, Guy Francon offered me a job with him some time ago. Today he said it's still open. And I don't know which to take.\" Roark looked at him; Roark's fingers moved in slow rotation, beating\nagainst the steps. \"If you want my advice, Peter,\" he said at last, \"you've made a mistake already. By asking me. By asking anyone. Never ask people. Not about your work. Don't you know what you want? How can you stand it, not to know?\" \"You see, that's what I admire about you, Howard. You always\nknow.\"\n\"Drop the compliments.\"\n\"But I mean it. How do you always manage to decide?\" \"How can you let others decide for you?\"\n\"But you see, I'm not sure, Howard. I'm never sure of myself. I don't know whether I'm as good as they all tell me I am. I wouldn't admit that to anyone but you. I think it's because you're always so sure that\nI...\" \"Petey!\" Mrs. Keating's voice exploded behind them. \"Petey, sweet- heart! What are you doing there?\"\nShe stood in the doorway, in her best dress of burgundy taffeta, happy\nand angry.\n\"And here I've been sitting all alone, waiting for you! What on earth are you doing on those filthy steps in your dress suit? Get up this minute! Come on in the house, boys. I've got hot chocolate and cookies ready for you.\"\n\"But, Mother, I wanted to speak to Howard about something impor- tant,\" said Keating. But he rose to his feet.\nShe seemed not to have heard. She walked into the house. Keating followed.\nRoark looked after them, shrugged, rose and went in also.\nMrs. Keating settled down in an armchair, her stiff skirt crackling. \"Well?\" she asked. \"What were you two discussing out there?\"\nKeating fingered an ash tray, picked up a matchbox and dropped it, then, ignoring her, turned to Roark.\n\"Look, Howard, drop the pose,\" he said, his voice high. \"Shall I junk the scholarship and go to work, or let Francon wait and grab the Beaux- Arts to impress the yokels? What do you think?\"\nSomething was gone. The one moment was lost.\n\"Now, Petey, let me get this straight...\" began Mrs. Keating. \"Oh, wait a minute, Mother! . . . Howard, I've got to weigh it care fully. It isn't everyone who can get a scholarship like that. You're pretty\n\n---\nIt was right and it was good, that house growing under his hand, because men were still worshiping the masters who had done it before him. He did not have to wonder, to fear or to take chances; it had been done for him.\n\n---\n\"You call that freedom?\"\n\"To ask nothing. To expect nothing. To depend on nothing.\" \"What if you found something you wanted?\"\n\"I won't find it. I won't choose to see it. It would be part of that lovely world of yours. I'd have to share it with all the rest of you-and I wouldn't. You know, I never open again any great book I've read and loved. It hurts me to think of the other eyes that have read it and of what they were. Things like that can't be shared. Not with people like that.\"\n\n---\nThere was no such person as Mrs. Wayne Wilmot; there was only a shell containing the opinions of her friends, the picture postcards she had seen, the novels of country squires she had read; \n\n---\n\"Don't you know that most people take most things because that's what's given them, and they have no opinion whatever? Do you wish to be guided by what they expect you to think they think or by your own judgment?\"\n\n---\nKeating let himself be carried by the torrent. He needed the people and the clamor around him. There were no questions and no doubts when he stood on a platform over a sea of faces; the air was heavy, compact, saturated with a single solvent-admiration; there was no room for anything else. He was great; great as the number of people who told him so. He was right; right as the number of people who believed it. He looked at the faces, at the eyes; he saw himself born in them, he saw himself being granted the gift of life. That was Peter Keating, that, the reflection in those staring pupils, and his body was only its reflection.\n\n---\n\"It is so commonplace,\" she drawled, \"to be understood by every- body.\"\n\n---\nWhat is kinder-to believe the best of people and burden them with a nobility beyond their endurance or to see them as they are, and accept it because it makes them comfortable? Kindness being more important than justice, of course.\"\n\n---\n\"It's good to suffer. Don't complain. Bear, bow, accept-and be grateful that God has made you suffer. For this makes you better than the people who are laughing and happy. If you don't understand this, don't try to understand. Everything bad comes from the mind, because the mind asks too many questions. It is blessed to believe, not to under- stand. So if you didn't get passing grades, be glad of it. It means that you are better than the smart boys who think too much and too easily.\"\n\n---\nAnd as Roark looked at him, he added: \"Don't worry. They're all against me. But I have one advantage: they don't know what they want.\nI do.\"\n\n---\n\"That's true,\" whispered Keating. He would not have admitted it to anyone else.\n\"You missed the beautiful pride of utter selflessness. Only when you learn to deny your ego, completely, only when you learn to be amused by such piddling sentimentalities as your little sex urges-only then will achieve the greatness which I have always expected of you.\"\nyou \"You... you believe that about me, Ellsworth? You really do?\"\n\"I wouldn't be sitting here if I didn't. But to come back to love.\n\n---\n\"Yes, if it's your chief concern. Don't you see how egotistical it is? To\nhell with everybody so long as I'm virtuous.\"\n\n---\nHe recognized nothing but the accuracy of his own judgment. \n\n---\nThere was no order in his read- ing; but there was order in what remained of it in his mind.\n\n---\nWynand showed no interest in the previous standing of his prey. He showed no interest in men of glittering success who had commercialized their careers and held no particular beliefs of any kind. His victims had a single attribute in common: their immacu- late integrity.\n\n---\nBut you have to flatter people whom you despise in order to impress other people who despise you.\"\n\n---\n\"I'd rather...\" Then he cried: \"I'd rather you'd express an opinion,\nGod damn it, just once!\" She asked, in the same level monotone: \"Whose opinion, Peter? Gor- don Prescott's? Ralston Holcombe's? Ellsworth Toohey's?\"\n\n---\n\"You're beginning to see, aren't you, Peter? Shall I make it clearer? You never wanted me to be real. You never wanted anyone to be. But you didn't want me to show it. You wanted an act to help your act-a beautiful, complicated act, all twists, trimmings and words. All words. You didn't like what I said about Vincent Knowlton. You liked it when I said the same thing under cover of virtuous sentiments. You didn't want me to believe. You only wanted me to convince you that I be- lieved. My real soul, Peter? It's real only when it's independent-you've discovered that, haven't you? It's real only when it chooses curtains and desserts you're right about that-curtains, desserts and religions, Peter, and the shapes of buildings. But you've never wanted that. You wanted a mirror. People want nothing but mirrors around them. To reflect them while they're reflecting too. You know, like the senseless infinity you get from two mirrors facing each other across a narrow passage. Usually in the more vulgar kind of hotels. Reflections of reflec- tions and echoes of echoes. No beginning and no end. No center and no purpose. I gave you what you wanted. I became what you are, what your friends are, what most of humanity is so busy being-only without the trimmings. I didn't go around spouting book reviews to hide my emptiness of judgment-I said I had no judgment. I didn't borrow de- signs to hide my creative impotence-I created nothing. I didn't say that equality is a noble conception and unity the chief goal of mankind-I just agreed with everybody. You call it death, Peter? That kind of death-I've imposed it on you and on everyone around us. But you- you haven't done that. People are comfortable with you, they like you, they enjoy your presence. You've spared them the blank death. Because you've imposed it-on yourself.\"\nHe said nothing. She walked away from him, and sat down again, waiting.\n\n---\nEvery building is like a person. Single and unrepeat- able.\"\n\n---\n\"It is a masterpiece,\" said Jules Fougler. \"I hope you will prove yourself worthy of it, Peter. It is the kind of play that depends upon what the members of the audience are capable of bringing with them into the theater. If you are one of those literal-minded people, with a dry soul and a limited imagination, it is not for you. But if you are a real human being with a big, big heart full of laughter, who has preserved the uncorrupted capacity of his childhood for pure emotion-you will find it an unforgettable experience.\"\n\n---\nMany stole Cameron's forms; few understood his thinking. \n\n---\nI would stand and say: I am Gail Wynand, the man who has committed every crime except the foremost one: that of ascribing futility to the wonderful fact of existence and seeking justification beyond myself. This is my pride: that now, thinking of the end, I do not cry like all the men of my age: but what was the use and the meaning? I was the use and the meaning, I, Gail Wynand. That I lived and that I acted.\n\n---\n\"Howard, I'm a parasite. I've been a parasite all my life. You de- signed my best projects at Stanton. You designed the first house I ever built. You designed the Cosmo-Slotnick Building. I have fed on you and on all the men like you who lived before we were born. The men who designed the Parthenon, the Gothic cathedrals, the first skyscrapers. If they hadn't existed, I wouldn't have known how to put stone on stone. In the whole of my life, I haven't added a new doorknob to what men have done before me. I have taken that which was not mine and given nothing in return. I had nothing to give. This is not an act, Howard, and I'm very conscious of what I'm saying. And I came here to ask you to save me again. If you wish to throw me out, do it now.\"\n\n---\n\"Howard - anything you ask. Anything. I'd sell my soul ...\"\n\"That's the sort of thing I want you to understand. To sell your soul is the easiest thing in the world. That's what everybody does every hour of his life. If I asked you to keep your soul - would you understand why that is much harder?\"\n\n---\nBoth are only the means of my work. Peter, before you can do things for people, you must be the kind of man who can get things done. But to get things done, you must love the doing, not the secondary consequences. The work, not the people. Your own action, not any possible object of your charity. I'll be glad if people who need it find a better manner of living in a house I designed. But that's not the motive of my work. Nor my reason. Nor my reward.\"\n\n---\nThe only thing that matters, my goal, my reward, my beginning, my end is the work itself. My work done my way. \n\n---\n\"You'll get everything society can give a man. You'll keep all the\nmoney. You'll take any fame or honor anyone might want to grant. You'll accept such gratitude as the tenants might feel. And I-I'll take what nobody can give a man, except himself. I will have built Cort- landt.\"\n\n---\nI never think of myself in relation to anyone else. \n\n---\n\"I've looked at him-at what's left of him-and it's helped me to\nunderstand. He's paying the price and wondering for what sin and telling himself that he's been too selfish. In what act or thought of his has there ever been a self? What was his aim in life? Greatness-in other people's eyes. Fame, admiration, envy-all that which comes from others. Oth- ers dictated his convictions, which he did not hold, but he was satisfied that others believed he held them. Others were his motive power and his prime concern. He didn't want to be great, but to be thought great. He didn't want to build, but to be admired as a builder. He borrowed from others in order to make an impression on others. There's your actual selflessness. It's his ego that he's betrayed and given up. But everybody calls him selfish.\"\n\n---\n\"Aren't they all acting on a selfish motive - to be noticed, liked, admired?\"\n\n\"- by others. At the price of their own self respect. In the realm of great important - the realm of values, of judgement, of spirit, of thought - they place others abve self, in the exact manner which altruism demands. A truly selfish man cannot be affected by the approval of others. He doesnt need it\"\n\n...\n\n\"That, precisely, is the deadliness of second-handers. They have no concern for facts, ideas, work. They're concerned only with people. They dont ask 'Is this true?' They ask 'Is this what others think is true?' Not to judge, but to repeat. Not to do, but to give the impression of doing. Not creation, but show. Not ability, but friendship. Not merit, but pull. What would happen to the world without those who do, think, work, produce? Those are the egotists. You dont think through anothers brain and you dont work through anothers hands. When you suspend your faculty of independent judgement, you suspent consciousness. To stop consciousness is to stop life. Second-handers have no sense of reality. Their reality is not within them, but somewhere in that space which divides one human body from another. Not an entity, but a relation. Anchored to nothing\"\n\n---\nIf any man stopped and asked himself whether he's ever held a truly personal desire, he'd find the answer. He'd see that all his wishes, his efforts, his dreams, his ambitions are motivated by other men. He's not really struggling even for material wealth, but for the second-hander's delusion-prestige. A stamp of approval, not his own. He can find no joy in the struggle and no joy when he has succeeded. He can't say about a single thing: 'This is what I wanted because I wanted it, not because it made my neighbors gape at me.' Then he wonders why he's unhappy. Every form of happiness is private. Our greatest moments are personal, self-motivated, not to be touched. \n\n---\nA self-sufficient ego.\n\n---\n\"We have never made an effort to understand what is greatness in man and how to recognize it,\" said another Wynand editorial. \"We have come to hold, in a kind of mawkish stupor, that greatness is to be gauged by self-sacrifice. Self-sacrifice, we drool, is the ultimate virtue. Let's stop and think for a moment. Is sacrifice a virtue? Can a man sacrifice his integrity? His honor? His freedom? His ideal? His convic- tions? The honesty of his feeling? The independence of his thought? But these are a man's supreme possessions. Anything he gives up for them is not a sacrifice but an easy bargain. They, however, are above sacrificing to any cause or consideration whatsoever. Should we not, then, stop preaching dangerous and vicious nonsense? Self-sacrifice? But it is pre- cisely the self that cannot and must not be sacrificed. It is the unsacri- ficed self that we must respect in man above all.\"\n\n---\nToohey - \"The world I want. A world of obedience and of unity. A world where the thought of each man will not be his own, but an attempt to guess the thought in the brain of his neigh- bor who'll have no thought of his own but an attempt to guess the thought of the next neighbor who'll have no thought-and so on, Peter, around the globe. Since all must agree with all. A world where no man will hold a desire for himself, but will direct all his efforts to satisfy the desires of his neighbor who'll have no desires except to satisfy the desires of the next neighbor who'll have no desires-around the globe, Peter. Since all must serve all. A world in which man will not work for so innocent an incentive as money, but for that headless monster-prestige. \"\n\n---\n\nEvery single thing I told you? Isn't Europe swallowed already and we're stumbling on to follow? Everything I said is contained in a single word collectivism. And isn't that the god of our century? To act together. To think- together. To feel-together. To unite, to agree, to obey. To obey, to serve, to sacrifice. Divide and conquer-first. But then-unite and rule.\n\n---\nAnything may be betrayed, anyone may be forgiven. But not those who lack the courage of their own greatness. Alvah Scarret can be forgiven. He had nothing to betray. Mitchell Layton can be forgiven. But not I. I was not born to be a second-hander.\n\n---\nThe misery of knowing how strong and able one is in one's own mind, the radiant picture never to be made real. Dreams? Self-delusion? Or a murdered reality, unborn, killed by that corroding emotion without name - fear - need - dependence - hatred?\n\n---\n\"Throughout the centuries there were men who took first steps down new roads armed with nothing but their own vision. Their goals differed, but they all had this in common: that the step was first, the road new, the vision unborrowed, and the response they received-hatred. The great creators-the thinkers, the artists, the scientists, the inventors- stood alone against the men of their time. Every great new thought was opposed. Every great new invention was denounced. \n\n---\n\"And only by living for himself was he able to achieve the things which are the glory of mankind. Such is the nature of achievement.\n\"Man cannot survive except through his mind. He comes on earth unarmed. His brain is his only weapon. Animals obtain food by force. Man has no claws, no fangs, no horns, no great strength of muscle. He must plant his food or hunt it. To plant, he needs a process of thought. To hunt, he needs weapons, and to make weapons-a process of thought. From this simplest necessity to the highest religious abstrac- tion, from the wheel to the skyscraper, everything we are and everything we have comes from a single attribute of man-the function of his reasoning mind.\n\"But the mind is an attribute of the individual. There is no such thing as a collective brain. There is no such thing as a collective thought. An agreement reached by a group of men is only a compromise or an average drawn upon many individual thoughts. It is a secondary conse- quence. The primary act-the process of reason-must be performed by each man alone. We can divide a meal among many men. We cannot digest it in a collective stomach. No man can use his lungs to breathe for another man. No man can use his brain to think for another. All the functions of body and spirit are private. They cannot be shared or transferred.\n\n---\nAnd here man faces his basic alternative: he can survive in only one of two ways-by the independent work of his own mind or as a parasite fed by the minds of others. \n\n---\n\n\"Degrees of ability vary, but the basic principle remains the same: the degree of a man's independence, initiative and personal love for his work determines his talent as a worker and his worth as a man. Inde- pendence is the only gauge of human virtue and value. What a man is and makes of himself; not what he has or hasn't done for others. There is no substitute for personal dignity. There is no standard of personal dignity except independence.\n\n...\n\n\"The first right on earth is the right of the ego. Man's first duty is to himself. His moral law is never to place his prime goal within the persons of others. His moral obligation is to do what he wishes, pro- vided his wish does not depend primarily upon other men. This includes the whole sphere of his creative faculty, his thinking, his work. But it\ndoes not include the sphere of the gangster, the altruist and the dictator. \"A man thinks and works alone. \n\n---\n\nRoark - \"I do not recognise anyone's right to one minute of my life. Nor to any part of my energy\""},{"id":"against-the-gods","title":"Against the Gods","author":"Peter Bernstein","date":"2021-08-19","stars":"4","isbn":"0471121045","content":"\n## Pre 1200: Beginnings\n- Probability and risk was borne out of gambling\n- It begun in Greece, when their philosophers were at the forefront of intellectual discussion\n- Counting and numbers were needed before probability could be known\n- Fibonacci and his series\n- The golden ratio\n- The abacus\n- The number system was developed by hindus\n- The centrepeice of the hindu number system was the invention of the number 0\n\n## 1200 -> 1700: A Thousand Outstanding Facts\n\n### The Renaissance Man\n- **Girolamo Cardano**\n\t- Extracted the first ideas of probability from gambling\n\t- Was also a gambling addict\n\t- Did a lot of work on combinations of numbers\n- **Luca Paccioli**\n\t- Came up with the \"problem of Balla\", in which two players are playing a game of balla and it is cut short. \n\t- The question is, how do you divide the pot among the two players? \n\t- Evenly? But what about the player who is clearly winning?\n\t- How much more should you give the winning player?\n\n### The French Connection\n- **Blaise Pascal & Pierre de Fermat**\n- Spoke about Paccioli's problem of Balla\n- How should the pot be split?\n- Very famous sets of letters were echanged between them\n- Pascals triangle\n- Pascals wager\n\t- If hell is as bad as it is described and heaven as good, then no matter how small the probability of it being real, you should beleive just in case\n\t- This is a probabilistic view of religion\n\n### The Remarkable Notions of the Remarkable Notions Man\n- Invariance\n- Demographic data\n- **John Graunt's** \"observations\"\n\t- Compiled insurance data\n\t- Aggregated the first \"statistics\"\n- Edmund Halley's \"Life tables\"\n\t- Predicted the occurence of a comet (Halley's comet)\n\t- Created an age distribution of the population\n- Edward Lloyd's coffee house -> Lloyds of london\n\n## 1700 -> 1900: Measurement Unlimited\n\n### Considering the nature of man\n- **Daniel Bernoulli** (Jacob's nephew)\n- Utility theory (thinking of utility as a function of value)\n- St Petersberg paradox\n- Human Capital\n- Loss aversion\n- Differing levels of risk aversion\n- \"Exposition of a new theory of the measurement of risk\"\n\n### The Search for Moral Certainty\n- **Jacob Bernoulli**\n- Abraham de Moivre (first observed and documented the bell curve)\n- Thomas Bayes\n- Moral certainty = **Statistical Significance**\n- Inference & Bayes' theorem\n- Assumes that events happening in the future will follow the same pattern (distribution) as in the past\n- Law of large numbers (Jacob Bernoulli)\n\n### The Supreme Law of Unreason\n- Carl Freidrich Gauss\n\t- Built on de Moivres observations of the **bell curve**\n- Marquis Laplace\n- Bell curve\n- Stock market randomness\n- Independence <--> Normal distirbution\n\n### The Man with the Sprained Brain\n- Francis Galton\n\t- Obsessed with measurement\n- Lambert Quetelet\n- The \"average man\" (L'homme moyen)\n- **Regression to the mean**\n- Average (\"standard\") deviations\n- Correlation\n\n### Peapods and Perils\n- Regression to the mean\n- Stock market overrreaction\n- Dangers of expecting regression to the mean all the time\n- What mean should be regressed to?\n\t- At what point has normal shifted to a new location?\n\n### The Fabric of Felicity\n- Utility\n- Which risks should be taken?\n- Preferences and tradeoffs\n- Daniel Bernoulli -> Jeremy Bentham -> William Jevons\n\t- Bernoulli built the groundwork\n\t- Bentham invented utility theory\n\t- Jevons built on it\n\n\n## 1900 -> 1960: Clouds of Vagueness and the Demand for Precision\n\n### The Measure of our Ignorance\n- Louis Bachalier: The theory of speculation\n- Acceptance of uncertainty\n- Birth of risk management\n- Kenneth Arrow\n- Practicality is introduced\n- Risk management becomes more pragmatic\n- There is so much randomness that nothing can be that precise\n\t- The gravitational pull of an electron in the milky way can affect a game of billiards on earth\n\n### The radically distant notion\n- Frank Knight\n- John Maynard Keynes\n- Moving away from probablity theory and toward practical applications and risk\n- Historical evidence cannot predict the future\n- Keynes: Intervention from government removes uncertainty\n\n### The Man who counted everything except calories\n- **John von Neuman**\n- Game theory\n- Oskar Morgenstern\n- Rationality\n- Other's decisions as the cause of uncertainty\n\n### The Strange Case of the Anonymous Stockbroker\n- **Harry Markowitz**: Optimal portfolio selection\n- **William Sharpe**: CAPM model\n- Max return sub to risk\n- Min risk sub to return\n- Variance may not be a good proxy for risk\n\n## Degrees of Beleif: Exporing Uncertainty\n\n### The failure of invariance\n- Kahnemen and Tversky\n- Prospect theory\n- Behavioural biases: Humans dont always act rationally\n- Loss aversion\n- Ambiguity aversion\n- Paradox of choice\n- Experimental economics\n\n### The Theory Police\n- Behavioural biases\n\t- Decision regret\n\t- Loss aversion\n\t- Risk aversion\n\t- Endowment effect\n- Market rationality\n- Market efficiency\n- Risk management in the 1970s\n- DeBondt & Thaler\n\n### The Fantastic System of Side Bets\n- Derivatives (financial options) reallocate risk \n- Black Scholes Merton model\n- Volatiliy & risk vs direction\n- 1987 portfolio insurance crash\n\t- Aimed to replicate a put option\n\t- Sold stock on way down\n\t- Bought as it came back up\n\t- Problem was too many people were doing in, so as stock prices began to go down they crashed really fast\n- 1990s companies speculating in derivatives\n\t- P & G\n\n### Awaiting the wildness\n- The future of risk management\n- Models of the future\n\t- Chaos theory\n\t- Neural networks\n\t- Genetic algorithms\n\n"},{"id":"a-people's-history-of-the-united-states","title":"A People's History of the United States","author":"Howard Zinn","date":"2021-07-28","stars":"4","isbn":"0060907924","content":"\n## Columbus Arrival in America (1600s)\n- Funded by the Spanish\n- Killed so many of the native americans\n- Everyone that went to America was looking for **gold**\n- When they didnt find gold they settled for slaves (had to bring something back)\n\n## Racism and the Color Line (1600s -> 1700s)\n- Black slaves **and** white servants\n- Servants not as low as slaves\n- Slave revolution was a constant threat for slave masters\n- South and north depended on slavery to different degrees\n\t- The south had plantations and hence needed slaves more\n\n## Independence from Britain (date?)\n- \"Bacon's Rebellion\"\n- Re-read with knowledge of US geography\n- UK was using the US for money (taxation etc)\n- Before this the US was all english colonies (GB basically owned america)\n- Americans fought against GB rule\n- Wanted land from both the UK and the native americans\n- \"7 years war\" - France vs GB for ownership of North America\n- France helped America to gain independence from GB\n\n## American Revolution (1750s -> 1800)\n- After independence from GB. Rich US landowners just did the same thing that GB did\n- This annoyed a lot of working class Americans, servants and slaves\n- They revolted against the new rich to gain a fairer society\n- Growth of \"anti-federalist\" ideas\n- US constitution was written **by** wealthy people, **for** wealthy people\n- Federalists vs Anti-Federalists: Federalism\n- After the revolution, the black population started asking for rights/equality\n\t> US constitution serves the interests of the wealthy while keeping enough for the poor that it gained lots of support\n- Bill of rights\n\n## Women of America\n- Women were literally forgotten about until > 1700\n- Constitution speaks of \"mans right to happiness\"\n- Women seen as weak and made for staying at home and bearing children\n- Their dresses were too heavy to do any activity\n- Had the job of housework and childbearing\n- 1700s-1800s: Worked like slaves (15h days) for 20% of a mans pay\n- Early 1800s: Start of feminism\n- Seneca falls\n- Women fought for the other oppressed causes too, like blacks, slaves, insane people, those in prison etc\n\n## Eradication of the Indians\n- Andrew Jackson lead their extinction (future president)\n- Indians were pushed west, continually promised they could keep the land they had, then pushed further west\n- US govt used laws and violence to physically and financially ruin all those who refused to give up their land\n- Indians could not vote (neither could blacks, women, or those without enough money)\n- Basically rich white men opressing everybody\n- Fighting back eventually became pointless as they were all arrested or killed\n- By the end, all indians were either west of the mississipi river or dead\n\n## America - Mexican War (1845 ->)\n- Mexico borders with Texas\n- Rio Grande: A grey area of ownership that the US tried to take for themselves\n- James Polk = President at the time\n- Mexico used to include: California, Texas, New Mexico. But the US took it in the US/Mexico war\n- Mexico surrendered in 1848, signing the **\"The Treaty of Guadalupe Hidalgo\"**\n- Mexico gave the US: CA, TX, NM for $15mm\n\n## Civil War (1861 - 1865)\n- Built up in the 1850s\n- South was strongly using slaves for plantations\n- North was not\n- People started campaigning for black rights (black and white abolitionists)\n- Despite the opression, there was strong culture and resolve from the slaves\n\t- Strength to rebel)\n- David Walker's \"appeal\"\n- Abraham Lincoln (Republican) was elected in 1860 and began gently proposing the idea of equality of race\n\t> North = \"Union\"\n\t> South = \"Confederacy\"\n- Emancipation proclamation -> Lead to the 15th amendment\n- 13th ammendment: Blacks are equal\n- Blacks fought for the north in the civil war and began deserting the southern plantations\n- This damaged the ability of the south to supply their troops\n- All plantation land either went to rich unionists or the highest bidder at an auction\n- Blacks got very little of the plantation land, most went back to slave masters\n- Their rights improved, but the civil war didnt much improve black's financial or political situation\n- Goal of the civil war was not to fight slavery, but to fight slave owning states (this lead to the topic of racial equality being more prominent)\n- The south still hated blacks\n\t- Created KKK\n\t- Mobs killed blacks by the hundreds\n\t- Rich southern financiers made life bad for blacks, using capitalism against them\n\t- Blacks had no land/property so they still had to work for whites\n\n## Strikes & Lower Class Revolt (1840s -> 1870s)\n- **Anti Renters\"\": Farmers who refused to pay rent to their rich land owners\n- At this point in time, the lower class could not even vote (not enough money)\n- So strikes and violence were the way to make a point\n- \"Jacksonian Politics\" began to recognise the lower class\n\t- Only because it was politically beneficial to do so\n\t- Gave the poor the bare minimum to not revolt\n\t- They often didnt do this very well, sparking revolts anyway\n- \"Dorr's rebellion\"\n- **Context:**: Communist Manifesto (Marx & Engles) published in 1848\n- Main strikes\n\t- Farmers anti-rent\n\t- Women at the textile mills\n\t- Railroad workers\n\t- Mines\n- Lower class began forming **trade unions** (separate for women/black)\n- Formation of the \"workingmen's party\"\n\n## Growth of Industry (& Socialism)\n- Businessmen\n\t- JD rockefeller\n\t- Andrew  Carnegie\n\t- Jay Gould\n\t- JP Morgan\n- American industry was being driven by ruthless monopolists\n- Influx of immigrants helped build railroads (also acted as strike-breakers)\n- Working class often went on strike for:\n\t1. Higher wages\n\t2. Shorter working hours\n- 1886 = \"The year of the great uprising of labour\"\n- 1880-1890: \"Farmers alliance\" --> **Populist movement**\n- Populism\n\n## Spanish American War\n- America was producing more than it could consume so it needed to expand to overseas markets\n- At the time, Spain ruled Cuba, so the *US helped Cuban rebels to overthrow Spanish control*\n- The war was over in 3 months\n- But instead of being independent, Cuba was now ruled by the US\n- Drivers of the war:\n\t- Nationalist - Expansionists wanting to grow the US empire\n\t- Capitalists - Businessmen and economists who saw that overseas markets would increase profits\n- When America beat Spain, they agreed to buy Guama, Puerto Rico and the Philipines from them (part of the Spanish Empire)\n\t- Philipines rebelled against US rule, and in a 3 year long war were all massacred\n\n## Socialism & the Progressive Periods (1900->1914)\n- Post war, workers realised they were still getting a bad deal\n\t- Continued the growth of **trade unions**\n\t\t- AFL = American Federation of Labour\n\t\t- IWW = Industrial Workers of the World\n- By now the unions would include everyone (including blacks/women)\n- Accompanied by womens demands for more rights\n- Progressive reforms\n\t- Roosevelt & Woodrow wilson\n\t- Aimed to satisfy socialists while maintaining capitalism\n\n## World War 1 (1914 -> 1918)\n- America got involved in 1917\n- Britain/France vs Germany\n- America was initially neutral, but stepped in to back up britain (had a lot of business interests in britain)\n- Many anti-war protesters were sent to prison due to the Espionage Act (meant that you could not talk badly of the war effort/conscription)\n- 80,000 americans died in WW1, probably most of them were lower class that opposed the businessmans war\n\n## Post War Class Struggles (1920s boom & 30s depression)\n- Unions became larger and more powerful\n- Now, instead of 1000 person strikes there were 100,000 person strikes\n- The working class was more organised\n- Economic boom of the 1920s was great for the middle/upper class but not the lower/working class\n\t- Wages didnt increase much, only the stock market did\n- Self help organisations popped up all over the place\n\t- Groups of unemployed people that would trade their services with each other (eg. Baker makes bread in exchange for getting shoes fixed by cobbler)\n- Great depression layoffs lead to mass meetings of unemployed workers\n- Workers unions were eventually recognised as entitites (this reduced the number of strikes)\n\n## World War 2\n- President = Truman -> Eisenhower -> JFK\n- America was on the side of France and England\n- Got officially involved after **Pearl Harbour** (Japanese raid on US harbour in Hawaii)\n- American people almost unanymously in favour of getting involved in the war\n\t- Nicknamed \"the peoples war\"\n- August 1945: America drops atomic bombs on Hiroshima & Nagisaki. Killed 100,000s\n- **Fascism**\n\t- Germany (Hitler)\n\t- Italy (Mussolini)\n- Japan in WW2:\n\t- Sided with the Nazis\n\t- Attacked their asian neighours\n\t- Attacked USA at pearl harbour\n- With Europe in peices, US and Russia could dominate the world with their respective ideologies of capitalism/socialism\n\t> Post WW2, Britain handed the role of world leadership over to the USA\n- Post WW2 USA/Russia rivalry = Cold war\n- Korean war of post WW2\n\t- After Korea split N/S\n- After WW2, Truman put a lot of effort into eradicating communism from America (and the rest of the world)\n\t- Fidel castro -> Cuban rebellion -> 1950s -> Sides with Russia -> America hates this\n\n## Civil Rights Movement\n- Black uprisings were beginning to look communist\n- This lead Truman to begin taking black equality and civil rights more seriously (to show America could control communism)\n- Denouncement of the \"separate but equal\" doctrine\n- Sparked by **Rosa Parks** (1954, Montgommery, Alabama where she sat in the white section and refused to move)\n- Wartin Luther King Jr\n- Malcom X\n- Muhammed Ali Muhammed Ali: His Life and Times\n- Violent black rebellion of the 1960s\n- Blacks and poor whites began working together in union\n\n## Vietnam War (1964->1972)\n- JFK -> Lyndon Johnson ->Nixon\n- After WW2, Vietnam was under French rule\n- The French and Vietnamese fought over control of Vietnam (France was heavily supported by America)\n- In 1954, after making no progress, France was forced to withdraw from Vietnam\n- There was a large communist movement in Vietnam during the time of French rule\n- When the French withdrew, America thought it should fight communism itself by going to war with Vietnam\n- 1962: JFK assassinated and Lyndon Johnson takes over\n- Communists in Vietnam = \"National Liberation Front\"\n- Entire villaged were forced into ditches by American solders and shot to death\n- CIA secretly killed 20,000 people that \"might\" have been communist\n- US dropped more bombs on Vietnam than the total of all bombs dropped during WW2\n- The Pentagon Papers\n- Very unpopular war, especially among blacks who refused to let the government opress others\n- America lost the war, signing the peace treaty in 1974\n- Their approach was to demoralise the Vietnamese troops via genocide and mass bombings\n- Their approach failed\n\n## Civil Rights Movement 2 \n\n### Womens Rights\n- Up to 1950s, womens role was to be a wife, cook, clean and bear children\n- In the working world Women only had roles that supported men (secretary, cleaner etc)\n- Womens rights aimed to change this view\n- Womens rights lobbyists managed to get some laws changed\n\t- Quickly found that changing laws and changing actions are not the same\n\t- As black people also found\n\n### Prisons\n- Back in the day prison was essentially forced hard labour\n- In the 60s/70s jail was predominantly poor black people\n- The rights movements of women and blacks inspired many rebellions in prisons\n- Sentences depended hugely on the judge, hence based on racism, sexism and wealth\n- Prisoners began caring for each other, ignoring race and uniting in rebellion against the prison\n\n### Indians\n- Had grown a bit in numbers by the 1970s\n- \"Wounded Knee\" - 1960s\n\n## 1970s: Govt regain Control\n- Watergate\n- Republicans and democrats heavily influenced by big companies donations\n- FBI & CIA\n- Nixon -> Ford -> Jimmy Carter\n- Government and big corporate were heavily interlinked (many govt officials came from big companies, banks and law firms)\n- Carter promised to implement reforms to move past Watergate and Vietnam and to do more for the people (he was popular)\n- His policies didnt work too well --> More strikers\n\n## Conclusions & Looking to the Future\n- Good summary of the book\n- Also  proclamation fo the dangers of Nuclear War\n- Proposed a \"neighbourly socialism without the dictatorship\" as a people's solution\n\n"},{"id":"the-art-of-doing-science-and-engineering","title":"The Art of Doing Science and Engineering","author":"Richard Hamming","date":"2021-05-16","stars":"4","isbn":"9789056995003","content":"\nI read this book after really enjoying reading the speech Hamming gave called [You and your research](https://www.cs.virginia.edu/~robins/YouAndYourResearch.html). If you're unsure if you want to give the whole book a read (it is a hefty tome), then start with that. \n\nThe speech summarises the idea of the whole book, namely,  using the one shot you get at life to make significant contributions to humanity. It emphasises a style of thinking more than a boilerplate approach. It uses example from various areas of his career in scientific research to hammer home the points, and some of that can get quite technical. But as Hamming mentions at the start, they are anciliary to the main idea of the book, so no need to get too bogged down in the maths if you don't want to. It's simply a way of showing how some the great minds he encountered approach problems.\n\nA final note that is important, dont try to internalise all the ideas of the book. Some will work for you, and others wont. Research and problem solving is a fundamentally personal activity, so see what resonates with you and build on that. \n\n---\n\n## Style of Thinking\n\n### Innovation\n\n#### Thinking about the future\n- Questions for the future\n  - What is possible\n  - What is likely to happen\n  - What is desirable to happen\n- How will the future be different from now?\n- How will it be the same?\n- Think about the future to anticipate change (passive to active)\n\n#### Thinking about new technologies\n- When you encounter a new technology, think in what new areas and ways can it be used? How will this be used in the future?\n- Always thinking of related concepts - how can this be applied elsewhere?\n- \"What are the real world uses of this idea?\"\n\n#### Affecting change\n- If you do not occasionally doubt accepted rules, you will not be a leader\n- Sometimes things that are technologically feasible and economically desirable are prevented for political, social and legal reasons\n- Innovation in a field usually comes from an external source/individual\n\n### Independent Thought\n- \"Believe nothing, no matter where it comes from, unless it agrees with your own sense of logic and common sense\"\n- See a technology - have a hypothesis - think of an experiment to test the hypothesis\n- Take a lot of time to **think** - come up with opinions, theories and hypotheses\n- Think about something until \"you are fairly clear what you believe and why you believe it\"\n- Do your own work instead of spending all your time in lectures\n- Make time to turn ideas over in the mind\n- Do not just drift along, think of what you want to be and how to get there\n- Have theories on lots of things\n- If you look around your organisation there are many things that should not happen but do because they are customary \n- Develop the ability to quickly learn new fields\n\n### Working Diligently\n- Software chapter - Have care and diligence, think before you write code\n- Prove all of your assumptions, this way you\n  1. Don't make bad ones\n  2. Have a deep idea of what is going on\n  - Am I satisfied this is correct? \n- Do the proofs yourself\n- How will you convince yourself that you have not made a mistake somewhere\n- Question your assumptions: \"Why do I believe whatever I believe?\"\n- Working calmly gives you longevity, but the breakthroughs come after frustration and emotional struggle\n\n### Problem Solving\n\n#### The problem\n- Be very clear on what the problem is\n- Complex idea --> what does it look like?\n- How does this fit into the whole picture?\n- When thinking of complex systems --> is it stable?\n- Think of how a system converges or diverges\n- Don't just think what a function is, what **class** is it from? What functions are similar to it? \n\n#### Your toolbox\n- Multidisciplinary (all the sciences)\n- Awareness of cognitive biases\n- Have a broad scientific/mathematical toolbox from which to draw\n- \"How can other subject areas apply here?\"\n- A key skill in mathematics is abstract pattern recognition\n- The lab and the field are two very different things\n- Mathematics requires application to be useful\n- Prepare your mind for the future, do not just memorise, but truly understand things\n- Be aware of the limitations of certain measures and methods\n- Flexibility should be a part of modern systems and processes\n- Different skills matter at different levels in a field\n\n#### Techniques\n- Start simple and build from there\n- Always start from the basics and build up from there\n- Back of the envelope calculations\n  - Retain information better\n  - Keep sharp the ability to model situations\n\n#### Fundamentals\n- Focus on these\n- They:\n  - Have stood the test of time\n  - Can derive the rest of the field\n- If you know the fundamentals well, the fancy parts follow easily\n\n### Working with Others\n- Understands that most others don't think like him\n- Teamwork is a necessity when working on complex projects - know and understand that others have different views to you\n\n### Great Work\n- There is no shortage of opportunities to do great things. The more prepared you are the better\n- Take pride in your ability to do great work, it will be important when confidence is needed\n- Creating new things requires self confidence\n- We are nothing more than the sum total of our habits\n\n## Engineering\n\n- Digital revolution\n  - Continuous signals --> discrete pulses\n  - Helped by transistors\n- Hardware chapter similar to Feynman computing book\n- L1 and L2 regularisation come from simplifications of n dimensional spaces. They are distance functions\n- Coding theory\n- Information theory should have been called communication theory \n- Quantum Mechanics\n  - Heisenberg's uncertainty principle\n- Data is rarely as accurate as you think\n- Systems engineering = high level thinking on a project/system\n  - Optimising the components of a system regularly ruins the performance of the whole system\n  - Systems approach to learning - being intelligent as opposed to just passing many individual exams\n- You get what you measure\n  - The method of measurement impacts the result you get"},{"id":"the-subtle-art-of-not-giving-a-fuck","title":"The Subtle Art of Not Giving a Fuck","author":"Mark Manson","date":"2020-09-28","stars":"5","isbn":"9781760558772","content":"\nThis is a really good book that essentially says we should find values in our lives that we see as more important than our own suffering. Such that we would willingly be uncomfortable in the name of something more important. Because happiness comes through suffering for the right causes, and coming out the other side stronger. \n\nManson then outlines some ideas on what these values might look like. However, it's obviously a very personal process so Manson does well not to put too much emphasis on what you should think.\n\nFinally, he has an entire website of articles too. This book is actually made up of a lot of the articles he had written over the years, but there's a lot more great content on there that relates to this book and his others. So I'd recommend anything on his site too.\n\n## Don't Try\\*\n- The pursuit of positive emotions leads to negative emotions and acceptance of negative emotions leads to positive emotions\n- Seeking things highlights the lack of it\n- No happy person is ever trying to be happy\n- Negative emotions are natural, not bad (they should not be avoided)\n- So stop trying to be happy and just accept what is\n\n\\*Fun fact - \"Don't try\" is all thats written on Charles Bukowski's tombstone\n\n## Happiness is a Problem\n- Your life will always have problems, that is a constant\n- On Happiness comes from solving problems\n- You have to **enjoy the pain** of solving these problems\n- \"What pain do you want to sustain?\"\n- Love the process\n\n## You are not Special\n- 1960s self esteem movement --> Entitled people\n- Entitled = Feel good about your positive traits (and shouldnt work for them)\n- Self worth = Feel good about your negative traits\n- Entitlement\n\t1) I'm awesome, I deserve special treatment\n\t2) I suck, I deserve special treatment\n- Your problems are **not** unique\n- Many people have had and will have the same problems (accept this and become more accepting of the problem)\n- Social media --> Everything seems extraordinary --> We must delete this concept by accepting that a lot of our lives will be mundane and uninteresting (and thats OK) --> We will begin to appreciate the simple pleasures\n\n## The Value of Suffering\n- Our values determine our problems, as well as our definitions of success and failure\n- Therefore **values determine the cause of our suffering**\n- I feel something --> why do I feel this way --> why does that make me feel this way --> ... --> What are my values\n- \"Why does that seem true?\"\n- Good values\n\t1) Reality based\n\t2) Socially constructive\n\t3) Immediate and controllable\n\n## Responsibility\n- You are responsible != It is your fault\n\t- Fault = past tense\n\t- Responsible = Present tense\n- Taking responsibility is empowering, while taking fault merely starts a blame game regarding things that have already happened\n\n## Uncertainty\n- Doubt drives growth\n- Certainty = comfort\n- Challenge your own beleifs\n- Insecurity is bred out of a **need** for certainty\n- Most of the time you just need to **be content that you dont know** (especially about yourself)\n- Be Antifragile\n- Dont be special\n\t- Define yourself in general terms (Artist, student, trader, ...)\n\n## Failure\n- Failure --> Learning --> Success\n- Pain is good - Part of the process\n- **Just do something**\n\t- Fear of failure makes us do nothing\n\t- Inspiration --> Motivation --> Action --> Inspiration --> Motivation --> Action --> ..\n\t- The only part of this cycle that we directly control is action. So if we want to kick it off, that's the only place we can do it\n\n## Rejection\n- Receiving it and giving it\n- If you reject nothing you are valueless/directionless\n- **To value X, we must reject not(X)**\n- Good relationships involve rejection\n\t- Reject taking responsibility for others values/feelings\n\t- Dont fear the small fights\n\t- Conflict is a good test of love\n- Consumerism --> Have more\n- Rejection --> Have less\n\n## Mortality\n- You are going to die anyway, why be afraid of anything you do beforehand?\n- You fear death when you are unhappy with your life experiences\n\n\n"},{"id":"how-to-read-a-book","title":"How to Read a Book","author":"Mortimer Adler","date":"2020-06-14","stars":"5","isbn":"9781797139852","content":"\nVery detailed account of how to approach a book, how to ask it questions and how to read different types of books. The main idea is to think of a book as a conversation with the author: What are they trying to tell you, and what questions do you have? \n\nIf on the other hand the book is more creative (fiction, poetry, etc), then the main goal is simply to experience the story. \n\n## 4 Questions For A Book\n\n1. **What is the book about as a whole?** - Understand the theme of the book\n2. **What is being said in detail, and how?** - Main ideas and arguments put forth\n3. **Is the book true, in whole or in part?** - Make up your own mind\n4. **What of it?**\n  - Why is the information in the book important\n  - Why does the author think so\n  - What further actions (if any) are implied\n\n## 4 Levels Of Reading\n\n### 1 Elementary Reading\n  - The kind of reading you learn in school\n  - If you cant do this you can't read a book\n  \n### 2 Inspectional Reading\n- **Systematic Skimming / Pre-reading**\n\t- Should take less than an hour\n\t- Aim to find out if the book is worth analytical reading\n\t- Get an idea of the macro structure of the book\n- **Superficial Reading**\n\t- Read it through without stopping if you don't understand something\n\t- Books are always easier the second time around\n\n### 3 Analytical Reading\n\n1. **Finding out what a book is about** (Answers question 1)\n    a. Classify the book according to kind and subject matter\n    b. State what the whole of the book is about with utmost brevity\n    c. Highlight the major parts in order and relation to one and other. Outline them as you did the whole\n    d. Define the problem or problems the author is trying to solve\n\n2. **Finding out what is being said in detail, and how** (Answers question 2)\n    a. Come to terms with the author by interpreting his keywords\n    b. Grasp the author's leading propositions by dealing with the most important sentences\n    c. Know the author's arguments, by finding them in, or constructing them out of, sequences of sentences\n    d. Determine which of his problems the author has solved, and which he has not. As to the latter, decide which the author knew he failed to solve\n\n\n3. Stage 3\n    a. **General Maxims of Intellectual Etiquette** (Answers question 3)\n        1. Do not begin criticism of the book until you have completed your outline and interpretation of the book\n        2. Do not agree disputatiously or contentiously\n        3. Demonstrate you recognize the difference between knowledge and mere personal opinion by presenting good reasons for any critical judgement you make\n    b. **Special Criterial for Points of Criticism** (Answers question 4)\n        1. Show wherein the author is **uninformed**\n        2. Show wherein the author is **misinformed**\n        3. Show wherein the author is **illogical**\n        4. Show wherein the author's analysis or account is **incomplete**\n\n### 4 Synoptical Reading\n\n1. **Stage 1**\n    a. Create a tentative bibliography of the subject in question\n    b. Inspectionally read all books in the bibliography to figure out which are most important\n\n2. **Stage 2**\n    a. **Step 1 - Find the relevant passages** (Relevant to the question at hand)\n    b. **Step 2 - Bring the authors to terms**\n        - Establish terms yourself\n        - Put all the authors in the same language (your language)\n    c. **Step 3 - Get the questions clear**\n        - Existence/character of the idea you are investigating\n        - How the idea is known/manifests itself\n        - The consequences of the answers to 1 and 2\n\n    d. **Step 4 - Define the issues**\n        - Ensure disagreement is not due to different conceptions of the question\n\n    e. **Step 5 - Analyse the discussion**\n        - Be objective - \"Look at all sides and take no sides\"\n\n## Approaches to Different Kinds of Reading Matter\n\n### Practical Books\n1. Books about clear rules\n2. Books about the principles that generate the rules\n  - **Specific questions**\n    a. What are the authors _objectives_?\n        - Everything depends on _the goal_ the book is trying to help you attain\n        - Be open to the authors arguments as to why the goal is worth acheiving\n    b. What are his _means_ of achieving them?\n        - **Agreeing/Disagreeing**\n            - If you agree, you must take action in accordance with the book\n            - Consider rule 4. Does the author solve the problem he set out to?\n\n### Imaginative Literature\n  - **Don'ts**\n    - Don't resist the effect the book has on you\n    - Don't look for terms, propositions and arguments\n    - Don't criticize the book based on truth\n  - **Structural**\n    - Classify the book according to it's kind\n    - Grasp the unity of the book\n    - Discover how the whole is constructed of its parts\n  - **Interprative**\n    - Elements of fiction are it's episodes and incidents\n    - Terms are connected in propositions\n  - **Criticism**\n    - Don't criticize the book unless you fully appreciate what the author is trying to get across\n\n### Stories, Plays and Poems\n  - No action (of the analytical sense) is required of you when reading this kind of literature\n  - To read it well, all you have to do is experience it\n  - Read it quickly and with total immersion\n\n### History\n1.  Read **Like a Story**\n2.  Read **Multiple Accounts**: History is biased, you must read more than one account of a period to understand it\n3. Read to **Understand Man**: Read history not only to learn about that period, but also to learn the way men act in all times\n\n### Science and Maths\n- State as clearly as you can the problem the author is trying to solve (most important question to answer)\n- Your goal is not to become competent in the subject matter but to _understand the problem_\n\n### Philosophy\n\n#### Two Types of Questions\n1. Those concerned with _what is_ or what happens in the world\n    a. First order\n    b. Second order - Questions about first order questions\n2. Those concerned with what _should or ought to be_\n\n#### Philosophical Styles\n1. Philosphical Dialogue (eg. Plato) - Conversational style between individuals\n2. Philosophical **Treatises/Essays** (eg. Aristotle, Kant)\n3. Meetings of **Objections**\n4. **Systematisation of Philosophy** (eg. Descartes, Spinoza) - Attempt to organise philosophy like mathematics\n5. **Aphoristic** Style (eg. Nietsche)\n    - A lot of thinking is left to the reader\n        - What question is the author trying to answer?\n        - Find author's _controlling principles_ (the unstated assumptions of the author)\n        - Respect the assumptions\n        - Read other philosophers writings on the same subject\n\n### Social Science\n- \\= Books dedicated to the pirsuit of systematic knowledge of human society\n- **Easy to read**\n- **Hard to read**\n- These books are on the topics people are most opinionated about\n- Many terms in social sciences have very vague and broad meanings\n- Hardest question to answer: _What kind of book is this?_\n- Social science must be read synoptically"},{"id":"algorithms-to-live-by","title":"Algorithms to Live By","author":"Brian Christian & Tom Griffiths","date":"2020-02-12","stars":"5","isbn":"9781627790369","content":"References: Algorithms\n\n## Optimal Stopping\n- The decision is not which option to pick\n- But how many options to consider\n- The **secretary problem**\n\t- You are interviewing secretaries\n\t- You can accept them or reject them\n\t- Once rejected they are gone forever\n\t- You can only compare secretaries by preference (ordinal / ranking)\n\t- How do you try to get the best?\n- Optimal\n\t- View 37% (1/e) of applicants\n\t- Then choose the next one that beats all the ones beforehand\n\t- \"Look then leap\"\n\t- Chance of getting the best applicant is 37% (even if there are 1,000,000 applicants)\n- Can be applied to either time or quantity\n- Modifications:\n\t- Can be rejected --> Start making offers earlier\n\t- Can go back to previous applicants --> Start making offers later\n\t- Cardinality --> **Threshold rule** where you take anyone over a certain threshold\n- The passing of time makes everything an optimal stopping problem\n\n## Explore / Exploit\n- Do we try new things or stick with our favourite ones?\n- Exploration = Gathering information\n- Exploitation = Using information\n- **Multi-Armed Bandit Problem**\n\t- Many slot machines with different odds of winning\n\t- You have a limited number of spins\n\t- How do you balance trying new ones with playing the best ones\n- Solutions\n\t- The value of exploration only goes down over time\n\t- So try new things (explore) early on, leaving time to exploit this information later on\n\t- **Stick on the winner** - Stay playing the winning slot until it loses, then move on (this is statistically better than random)\n\t- **Regret minimisation** - Choose the option where the top end of the confidence interval is best (essentially be optimistic)\n- Studies show that people generally tend to **over** explore\n\n## Sorting\n- Scale is painful in sorting theory\n- Big-O notation: Denotes an algorithms worst case scenario\n- Solutions\n\t- Bubble sort: O(n^2)\n\t- Insertion sort: O(n^2)\n\t- Divide and conquer: \n\t- **Merge sort**: O(n log n)\n- n log (n) is the best possible (Mergesort)\n- Interesting problems arise when you add **noise** to the comparisons (ie they arent always correct, eg. Sports games)\n- Sorting is not necessary if searching is easy (think of an email inbox)\n\n## Caching\n- Cache = Short term memory\n- The problem is: What do you (or the computer) forget once the cache is full? How do you keep the most important info?\n- Solutions\n\t- FIFO & LIFO\n\t- **Least Recently Used** = Best\n\t- Nogutchi filing system = One pile of paper, put back on top when done using it, then always start searching from the top\n- The \"forgetting curve\"\n\n## Scheduling\n- If you only have one machine, then doing all the tasks will take the same amount of time. Hence scheduling is not important\n- If you have two machines (washing machine and drier)\n- Solutions\n\t- **Shortest Processing Time**: Start with the task that will be done fastest\n\t- Priority weighted to do list (Order by priority weight divided by time to complete)\n\t- Priority inheritance - If you have something low priority that needs to be done before something high priority, then it too is high priority\n- **Thrashing**\n\t- Context switching carries a cost, so minimising it is beneficial\n\t- Thrashing is excessive context switching, you should avoid this\n\t- Batching helps with this\n\t- So does rejecting new tasks\n- Metastablility\n\t- Not doing anything because you dont know what to do\n\t- Doing something always better than nothing\n\t- Pomodoros good for this (establish a minimum time to spend on something)\n\n## Bayes Rule\n- Laplace's law\n- Bayes Rule\n\t- P(A | B) = P(B | A) * P(A) / P(B)\n- Lindy Effect\n- Distributions (p. 142 good for this)\n\t- Normal --> Average prediction\n\t- Power Law --> Multiply prediction\n\t- Erlang --> Additive prediction\n\n## Overfitting\n- Problem: **Bias variance tradeoff**\n- Solutions\n\t- Cross validation\n\t- Penalizing complexity\n\n\n## Relaxing\n- **Constraint relaxation**\n\t- Solve a similar problem with fewer constraints\n\t- *What would you do it you werent afraid?*\n\t- *What would you do if you couldnt fail?*\n\t- *What would you do if all jobs paid the same?*\n- Continuous relaxation\n- Lagrangean relaxation\n\n## Randomness\n- Sampling\n\t- Large enough samples represent data well\n\t- Collecting data is key: Make sure you have truly random samples first\n- Monte carlo method = Random simulation\n- Simulated annealing \n- Randomness for good\n\t- Randomness --> Creativity\n\t- The idea of the **random wiki link** on your computer\n\n## Networking\n- All network communication starts with **protocols**\n- Eg. HTTP\n- \"Packet switching\"\n\t- Messages are atomised and input into a stream of data\n\t- Responses are sent as ACKs that show message has been received\n- \"Exponential backoff\" - Delay the next attempt to contact the person by double the delay last time you tried\n- Additive Increase, Multiplicative Decrease (AIMD)\n\t- Add things\n\t- When you hit a threshold, cut off a certain % of them\n- Buffering\n\t- Prevents taildrop\n\t- Humans dont have taildrop\n\n\n## Game Theory\n- Recursion\n- \"Levelling\" in poker: Understanding the level your opponent is on and playing one level higher\n- Nash equilibria\n- **Algorithmic game theory** \n\t- About finding NEs using efficient algorithms\n\t- Takes into account not only the solution, but the computation effort of the players in finding the solution\n- Looking for dominant strategies\n- Nash equilibria are not always optimal\n- Mechanism design\n\t- Changing the rules of the game\n\t- Creating rules that you know will result in the behaviour you want\n\t- Evolution has done a lot of mechanism design (eg. Emotions)\n- Marriage is a prisoners dilemma problem\n- Information cascades\n\t- Rational theory of bubbles\n- Pure honesty: \"If I design an algorithm that already optimises for you, you won't need to do anything\"\n"},{"id":"influence","title":"Influence","author":"Robert Cialdini","date":"2019-09-07","stars":"5","isbn":"9780061241895","content":"References: Psychology\n\nA classic for a reason.  The book is very well organised, you never find yourself lost or wondering \"how does this relate to the book/chapter?\".  Each chapter explains one characteristic of human psychology and how it can be used to influence an individual. But so as to not sound so evil, the approach is how to be aware of these tactics and prevent others from applying them on you. Still though, wouldn't stop you using them the other way around.\n\n## Weapons of Influence\n- Animals commonly react to \"trigger features\" which they use as shortcuts\n- Humans do the same\n- These shortcuts create \"weapons of influence\" which people can use against you\n- Eg.\n  - Because Principle: People are more likely to comply if you give a reason\n  - Expensive = Good: People expect to get what they pay for\n  - Contrast Principle: Everything is relative\n\n## Reciprocation\n- You feel obliged to repay those that gave you a gift or did you a favour (this can be exploited)\n- \"Reject then retreat\" = Making a cconcession so that the other party will too\n- Prevent this by seeing gifts/favours as sales devices and tricks of the trade\n- This combines with the contrast principle when \"rejection then retreat\" is used\n- It can overpower how to feel about someon\n- It also prompts unfair exchanges\n- If you are using this tactic - Don't be too unreasonable with your first request\n\n## Commitment and Consistency\n- Humans have an obsession to appear consistent\n- Initial commitment --> Act in a manner **consistent with your commitment**\n  - You must take **inner responsibility** for the commitment\n- We view ourselves through the lens of the actions we take\n- Then we comply and act in accordance with this self-image\n- The more public the commitment the stronger the need for consistency\n- Putting more effort into commiting to something --> More consitsent\n- No strong outside pressure --> **Inner responsibility**\n- \"Lowballing\"\n- \"If I knew what I know now, would I make the same choice?\"\n\n## Social Proof\n- We use the actions of others to determine what is right/correct when:\n  - We are uncertain\n  - Those people are similar to us\n- **Pluralistic ignorance** = Everybody does nothing because everybody else is doing nothing\n  - Strongest among strangers\n- To force an action (eg. Getting help during an attack), you must be specific - Tell a specific person to do a specific thing\n- Avoiding the trap\n  - Look for fake instances of social proof so you know when to get off autopilot\n  - Look out for the crowd acting foolishly, there is a good chance they know no more than you do\n\n## Liking\n- People like\n  - Physical attractiveness\n  - Those similar to themselves\n  - Compliments\n  - Cooperation (people you have cooperated with)\n- Watch out for people who are suspiciously similar to you\n- In order to produce liking, cooperation should not be unpleasant\n- You and others form an opinion of you based on what you are associated with\n  - Hence why we try hard to make public good associations and to hide bad ones (works both ways)\n- Watch out for times you seem to like people too much / too quickly\n- Association --> Food\n\n## Authority\n- We are unable to defy authority\n- We obey automatically, not considering the pros/cons\n- The **appearance of authority is enough**:\n  \ta. Titles - MD, Dr\n  \tb. Clothes - Uniform, suit etc\n  \tc. Trappings - Expensive clothes, cars\n- Question the expertise of authorities to get past their appearance\n- Is the expert trustworthy?\n- Watch out - Authority figures may make initial concessions to appear on your side/more honest\n\n## Scarcity\n- Opportunities seem more valuable to us when their availabiltiy is limited\n- Same applies to the time available - \"deadline tactic\"\n- **Psychological reactance theory** = When free choice is limited, the need to retain our freedom makes us desire that which is scarce\n- Scarce information is more convincing\n- The principle is stronger when:\n  - The item has recently become more scarce\n  - Scarcity is caused by social competition (other people buying the last ones)\n- Say no by\n  - Focusing on the use of the item and not its scarcity\n  - Remember the function of the item is not affected by its availablility"},{"id":"the-character-of-physical-law","title":"The Character of Physical Law","author":"Richard Feynman","date":"2019-05-10","stars":"5","isbn":"0679601279","content":"References: Physics\n\nIn my opinion, when it comes to physics, Richard Feynmen is the daddy. He was known as 'the great explainer' for a reason. This book is taken from a lecture series he did at Cornell university. And true to his nickname, he explains each concept brilliantly. \n\nEach idea is explained conceptually and in a way that makes sense to the layman. It's not mathematical at all. In fact I would say this is one of the best top-down primers to the subject of Physics that you can get. \n\nMy notes are below, but honestly, it isn't a long book and you'd do much better to get the explanations from Feynman than you would from my second hand interpretations.\n\n## Introduction\n- Feynman was against formalisms\n- He treated life like a big game\n- The role of **symmetry** and **conservation** are present throughout the book\n- He discovered a physical law regarding the weak force\n\n## The Law Of Gravitation\n- Gravitation is described by 2 equations\n      1. F = G(mm'/r2)\n      2. F = ma\n- **Kepler's** laws:\n      1. Orbits follow an ellipsis\n      2. Area between two radial vectors is always equal over the same stretch of time\n      3. Time to complete an orbit is proportional to (size of orbit)3/2\n- Physical laws allow us to discover new laws\n- Einstein made changes to Newton's laws to account for **relativity**\n- The law of gravitation does not apply on the **quantum scale** - there is no strong theory of quantum gravity\n- Physical laws are:\n      1. Mathematical in expression\n      2. Not exact\n      3. Simple, hence they apply widely\n- Stars are formed by gaseous blobs of dust grouping together thanks to gravity\n\n## The Relation Of Mathematics To Physics\n- Maths allows us to explain how things work, not why\n- Physics is inefficient in the sense that it does not build up from fundamental axioms like maths does\n- There are many ways to look at and think about the same theory\n      1. Newtons law\n      2. Local field theorem\n      3. Minimum principle\n- Mathematics is very generalist (eg. For n dimensions) whereas physics is applied (eg. N=3 dimensions)\n\n## The Great Conservation Principles\n- Almost all physical laws have the conservation laws in common\n- These laws allow physicists too discover new particles/laws by assuming the conservation laws hold\n- Conservation of energy can explain most of the other conservation laws\n- How does the theory of relativity impact the conservation principles? - pp65\n\n## Symmetry In Physical Law\n- Defn: Changes which have **no effect** on the physical laws\n- Symmetry and conservation laws are interlinked\n\nWorking symmetries:\n    1. Translation in space\n    2. Translation in time\n    3. Rotation in space\n    4. Relativity (uniform velocity in a straight line)\n\nNot working symmetries:\n    1. Change in scale (minimum limit due to particles)\n    2. Change in angular speed\n    3. Reflection in space\n\n- Electrons exit a beta decay spinning to the **left**\n- The world is not symmetrical if right and left are not the same - reflection in space does not work\n\n## The Disctinction Of Past And Future\nOn a fundamental level, all physical laws should work when time is moving backward. Take the coloured water example:\n- Even though light blue water would look weird splitting back up into clear and blue, it wouldn't look weird if a blue atom collided with a white one (it would look the same as if you played it forward)\n- A collision is random, so will look the same going backward\n- The water does not split back up into blue and clear, but it is not impossible, just highly unlikely\n\nWe have also reason to believe that Beta decay may not be time sensitive either. \n\nFinally a fun side note. 7.82m volts = an energy level in carbon. If this energy level did not exist then we would not have more than half the elements in the periodic table (nb: what is an energy level?)\n\n## Probability And Uncertainty\nThis chapter relates to the quantum mechanical view of nature\n- **Particles** - Discrete, experience no interference (\"bullets\")\n- **Waves** - Continuous, experience interference\n- Electrons are discrete, but experience interference unless you observe them by exposing them to light\n\nWave particle duality is best explained by the double-slit experiment (shout-out to my A level physics teacher Mr Rice)\n- There are two particles which have this feature\n      1. Light (photons)\n      2. Electrons\n- The probability of arrival of the electrons is distributed like the intensity of a wave\n- In this experiment, there is no way of predicting which hole the electron will pass through\n\n## Seeking New Laws\n- Particles explain most phenomena (at low energy)\n- If you combine all known laws of physics then you break some equations (things = infinity or divide by 0 etc) and so we know that they are missing something / something is wrong\n- To get new laws:\n      1. Guess\n      2. Compute results\n      3. Compare to the experiment\n- Most phenomena can be explained by:\n    1. Electrons\n    2. Photons\n    3. Gravitons\n    4. Neutrinos\n    5. Protons\n    6. Neutrons\n    7. ... And their anti particles\n- Sometimes, when looking for new laws you have to choose some of the existing laws to drop\n- Any good physicist knows multple theories for the same thing"},{"id":"antifragile","title":"Antifragile","author":"Nassim Taleb","date":"2018-10-18","stars":"5","isbn":"9781400067824","content":"References: Antifragility | Risk\n\n## Antifragile: An Introduction\n- A little bit of something bad is good for you\n  - E.g Having a good competitor or using white noise to sleep\n- Information is antifragile\n- Certain jobs are more antifragile than others. Think of an author vs a CEO (Any press is good press for an author)\n- _Iatrogenics_: When a treatment causes more harm than good - I.e intervening in something had a negative impact\n  - For example a personal doctor will make you take lots of medication you don’t need for the sake of naïve intervention\n- Fragility - You have more to lose than you do to gain, volatility hinders you\n- Antifragility - You have more to gain than you do to lose, volatility benefits you\n\n## Modernity and the Denial of Antifragility\n- Society relies on control\n- People want so much control that they become antifragile\n- *\"Light control works, close control leads to overreaction\"*\n- We vaccinate our children each year but do not do the same in other disciplines for adults/politicians\n- _Naïve Intervention_: Intervening just because you feel as though you should do something (Needing close control)\n- Modern society struggles to filter the signal from the noise - There is so much information going around and we aim to react to all of it, not just the important parts\n\n## A Non-Predictive View of the World\n- Stoicism in the modern day\n  - \\= \"Someone who transforms fear into prudence, pain into information, mistakes into initiation and desire into undertaking\n  - Stoicism is an antifragile philosophy of not controlling what needn't be controlled\n- Barbell strategy\n  - Aiming to survive before you thrive\n  - For example choosing a portfolio where you have 90% cash and 10% in volatile assets - You won't lose all your portfolio, which is a real possibility if you are in a 60/40 bond equity one\n\n## Optionality, Technology and the Intelligence of Antifragility\n- Optionality allows you to benefit from asymmetry and volatility\n- Having and creating more options mean that unexpected events in your life are now beneficial\n- Options have unlimited gain with a limited loss - This is a positive asymmetry that you should be exposing yourself to\n- \"An option is the weapon of antifragility\"\n- Technological advances come as a result of tinkering, of trial and error. I.e from antifragile researchers\n- **A lesson in disorder** - The best chapter\n  - Life education is not the same as classroom education\n  - You need to go out and read your own books which you found\n  - Meet people, have conversations\n  - Try new experiences\n  - School cannot teach you these things, but they are exactly what makes you antifragile and robust to life\n  - Reading is an act full of optionality - You can choose a book and then not read it if you don't want\n  - \"The trick is to be bored with a specific book, not with the act of reading\"\n  - Taleb would read for 30-60 hours a week!\n  - When you are bored, swap books - Do not stop reading though\n\n## The Non-Linear and the Non-Linear\n- All about how to detect antifragility\n- Shocking something antifragile is beneficial, but depends on intensity\n  - Fragile beings are harmed more by one large shock than many small ones\n  - Antifragile beings benefit more from one large shock than many small ones\n- Eating protein in a volatile manner (None on Monday and double on Wednesday) is better for you according to some studies - Find these studies\n- Do not cross a river if it is on average 4 feet deep - If you are antifragile the average means very little to you\n- Convexity - Average of f(x) is geater than f(average x)\n- Optionality means you can be wrong a lot - Your payoffs are larger than the costs\n\n## Via Negativa\n- Going the way of what is wrong, not what is right\n- Knowledge is subtractive, not additive (Grows by removing what is incorrect)\n- Being wrong is an antifragile state, because you have the option to find out that you are right\n- Do you have more than one reason for something? You might be convincing yourself to do it\n- Lindy Effect:  The old is predicted to outlast the young by proportion of their age\n  - Reading the classic books will give you a far more lasting education then new big thing on the shelves now\n- Classical texts last much longer - Antifragile knowledge\n- Fragility on a small scale gives you antifragility on a large scale\n  - Vaccinations\n  - Evolution\n- Taking the via negativa can mean getting rid of things you have - Less posessions = Happier\n\n## The Ethics of Fragility and Antifragility\n- Talking is a free option\n- If you want to know what someone thinks, look in their portfolio\n- Actions are larger than words\n- Practice what you preach and you have nailed this chapter\n- \"The best way of checking whether you are alive is to see if you like variations\""},{"id":"autobiography-of-benjamin-franklin","title":"Autobiography of Benjamin Franklin","author":"Benjamin Franklin","date":"yyyy-mm-dd","stars":"4","isbn":"9781435119895","content":"\nThis book has a lot of gold in it, but you've got to put in the work to go looking for it. The old fashioned english used and the fact there is no organisation to the book (it's just one long piece of text) make it among the harder books to read. Especially at the start as you are just getting used to the language. \n\nThat being said, you'll be glad you read it when youre done. But if you still can't be arsed to read it. Take a look at my thoughts below. \n\n## Main Ideas\n\nBe a **good judge of character**. This way you can test who is worth your time and who is not\n\nBe **good to people**. Not only because it is the right thing to do, but because it will help you in the future too.\n\n**Spend your time wisely**. What you do on a daily basis impacts the man you are in the future (--> The Power of Habit)\n\n**Spend time with the right people**. Actively spend time with people who are good for you (intelligent and impressive), while removing those who are bad for you.\n\n**Have a set of values**. He wrote that the two principles that will make a poor mans fortune are above all others probity (Having strong morals) and integrity. Live by them and let them guide you, it will give you the reputation of being a well principled person\n\n**Read and learn insatiably**\n\n## 13 Virtues\nFranklin created for himself 13 characteristics that he wanted to develop. He tracked each of these habits individually, noting with a dot in his journal when he did not adhere to them. He began with number 1, and only moved onto the next one only once he had completed an entire week of no dots.\n\n1. **Temperance**. Eat not to dullness; drink not to elevation.\n2. **Silence**. Speak not but what may benefit others or yourself; avoid trifling conversation.\n3. **Order**. Let all your things have their places; let each part of your business have its time.\n4. **Resolution**. Resolve to perform what you ought; perform without fail what you resolve.\n5. **Frugality**. Make no expense but to do good to others or yourself; i.e., waste nothing.\n6. **Industry**. Lose no time; be always employed in something useful; cut off all unnecessary actions.\n7. **Sincerity**. Use no hurtful deceit; think innocently and justly, and, if you speak, speak accordingly.\n8. **Justice**. Wrong none by doing injuries, or omitting the benefits that are your duty.\n9. **Moderation**. Avoid extremes; forbear resenting injuries so much as you think they deserve.\n10. **Cleanliness**. Tolerate no uncleanliness in body, cloaths, or habitation.\n11. **Tranquillity**. Be not disturbed at trifles, or at accidents common or unavoidable.\n12. **Chastity**. Rarely use venery but for health or offspring, never to dullness, weakness, or the injury of your own or another's peace or reputation.\n13. **Humility**. Imitate Jesus and Socrates.\n\n## Reading & Writing\n\nFranklin read voraciously, and noted a few books that he learned a lot from\n1. On human understanding (Locke) - Combined with the below book to learn thought/philosophy\n2. The art of thinking (Messrs, du port royal)\n3. Memorable things of socrates (Xenophon) - To learn the socratic method\n\nHe also believed that his autobiography (and biographies in general) build indirect experience of events and lives\n\n## Thought and Opinion\n- Shared knowledge is better than knowledge kept secret\n- He wrote many essays, learning how to write well from a young age by arguing with a pen pal\n- The change inflicted by his essays show the power of a well thought through argument\n- If you wish improvement of knowledge then hold your opinions and thoughts loosely\n- Formed the **Junto Club** to disscuss important matters with his intelligent friends\n  - Matters of philosophy, politics, morals etc\n  - Each meeting someone would write an essay which was to be discussed in the meetings\n\n## Relationships\n- Lent a lot of money to his friends, he often was not paid back\n- He built and added to his network of \"ingenious\" people whenever he met someone clever\n- He **sought out the intelligent and impressive people** wherever he went, not just waiting to stumble upon them\n- How people see you is important, so you should make sure that your reputation is going to do you favours (Act as if)\n- Not only did he seek out intelligent people, he also removed those who were bad for him in a ruthlessly critical manner.\n- He found that people respond better to suggestions when you present them on behalf of a group not an individual, this is how Franklin sold subscriptions to the library for the junto club\n- \"He that has done you a kindness will be more ready to do you another\"\n- He was always judging the character of other people, by doing this he became very good at it. Shows the benefits of a **strong judge of character**\n- Being a good person makes people want to be lead by you. The 13 virtues were Franklins way of building the character necessary not only to be able to lead, but to be wanted as a leader\n- In the back of your mind, always be thinking in one way or another \"how can I benefit others\"\n\n## Hard Work\n- Many people called him the hardest worker he knew\n- One of his principles was \"Industriousness\" which he valued incredibly highly\n- **Spend your time wisely**. Once the library in Philadelphia was up and running he made the choice every day to spend time there instead of in the tavern. Replacing the education he says he did not get in the formal sense\n- When the going gets tough, a lot of people change their original goal to save some work, Franklin says this is not something to make a habit of as it leads to worse work\n- Never reject a position because you feel you are inexperienced, only if it is against your virtues\n\n## Commendable Acheivements\n- Founding the **junto club**\n- Started the first library in Philadelphia\n- Conducted the experiments which proved lightning is just electricity (lightning rods)\n- Set up the \"Union Fire Company\", essentially the first fire brigade\n- Wrote a book on science experiments"}]