[
  {
    "id": 1626048000,
    "title": "Hash Sets and Organisation",
    "author": "Barney",
    "date": "2021-07-12",
    "content": "\nSome things are worth organising, while others are not. Think for a second about your own life, what do you organise? Your clothes? Books? Passwords? Emails? Chances are you implicitly follow something similar to the system I will talk about below, and if not then this should help you get a better idea of whether its worth doing so.\n\nOne note before I dive in, I will use \"organise\" and \"sort\" interchangebly in the rest of this essay. I am aware they are not the same at the fundamental level but the concept I'm getting acrossis the same with either action.\n\n## When should we organise?\n\nThis is essentially the same question as why should we organise, and the answer is straightforward: Organise when doing so is less effort than searching through the unorganised version. I first read about this idea in Algorithms to Live By (Christian and Griffiths). In the book the authors talk about the trade-off between sorting and searching and explain, as I have done, that it is only worth organising your \"stuff\" if it takes a long time to search through all that stuff relative to the amount of time it would take to sort. The authors don't give an explicit law to follow unlike in other chapters (my favourite remains the solution to finding a partner being 1/e), however the idea is still legitimate. When the cost of searching exceeds the cost of sorting, we should sort (and vise versa).\n\nConsider two situations: Firstly, when we can quickly sort something to make it much faster so search through, we should. Take your laundry for example. After washing your clothes, drying them, and taking them out of the drier, the cost to you of organising them then and there is much less than the cost of searching for the item you need when the time comes. On the other hand, when it takes a long time to sort something which is pretty easy to search even when unsorted, we shouldnt. In this case take your email inbox, there could be thousands of emails in there, but so long as you remember something about it such as who it was from or what was in the subject, then its not really worth spending the time to put each message into its respective folder.\n\n## How should we organise?\n\nUnorganised data is well represented by an Array. An Array is an ordered list of items (integers, strings, phone numbers, etc), and in some more modern programming languages such as Python they are called Lists. Arrays have an order but no separated organisation, and hence do well to represent the cost of disorganisation as follows: In order to check if an item is in the array you have no good strategy. Your best bet is just to check each item in any order that takes your fancy. This means that searching an Array twice as long will on average take you twice as long, the search algorithm is O(n).\n\nHowever, if we organise our data, then we can vastly improve this search efficiency. In Computer Science, one way to represent organisation that I have recently found interesting is through HashSets. A HashSet is an array of \"buckets\" which uses a hash function to decide which bucket each item goes into (a bucket in turn being an array). The hash function takes an item as the input, runs some operation on it and produces a hashcode, a number that correlates to a bucket in the HashSet. For example, a hash function might take the string \"Dog\", calculate the length as 3 and hence put the string in the 3rd bucket. The benefit of the hash function is that it can be run on items that we are searching for too. If we want to find \"Dog\" we know that we only need to look in the 3rd bucket, if its not there then its not in the HashSet. Intuitively this is no different to organising your clothes, where you have a hash function that takes inputs like t-shirts, shorts, socks and outputs locations like wardrobe, top drawer and bottom drawer (or perhaps floor, floor and floor in some cases).\n\nThis improvement in search efficiency allows for us to find items with an complexity closer to O(1), compared to O(n) previously, depending on the average number of items per bucket (known as the load factor).\n\nPut simply, you can find things faster if you know where you always put them.\n"
  },
  {
    "id": 1599264000,
    "title": "Monty Hall",
    "author": "Barney",
    "date": "2020-09-05",
    "content": "\nI remember coming across a quote somewhere that went like this: “If you can’t explain something to a computer you don’t understand it well enough”. I’ve since been looking for an interesting use case for this and have found one to satisfy my little wants in a problem called the Monty Hall problem, whose solution can often be tricky to comprehend (like it was for me). I won’t bore you with an explanation of the problem however, I’ll let Kevin Spacey in the gambling film 21 do it for me [here](https://www.youtube.com/watch?v=Q5nCtgcL4jU).\n\nSimply put, you choose a door out of the three available. A duff door is then opened, leaving you with two doors left, and you are asked if you want to swap your choice of door. The answer? Always.\n\nNow when I first saw this problem, I don’t think I was alone in thinking that swapping doesn’t matter because each door has a 1 in 3 chance of containing the prize. However, in this case first glances are deceiving. So in an effort to better understand the rationale behind swapping doors I explained the problem to my computer.\n\nThe following little program simulates the Monty Hall problem 10,000 times, calculating the win probabilities of both switching and not switching. Running this code will tell you that the probability of getting a car if you change is 0.67, while if you don’t change its 0.33. As Ben tells us, you do in fact double your chances of getting a new car by switching.\n\nHere's the code:\n\n```\nimport numpy as np\nimport pandas as pd\ndef simulate_game():\n    # Create 3 doors, one randomly containing a car and the other two containing goats\n    door_list = ['rand1', 'rand2', 'rand3']\n    door_list[door_list.index(np.random.choice(door_list))] = 'car'\n    for i in range(len(door_list)):\n        if door_list[i] != 'car':\n            door_list[i] = 'goat'\n    # Assume initially that the choice is made at random\n    choice_initial = np.random.choice(door_list)\n    # Host opens (removes) one goat\n    door_list.remove('goat')\n    # When given option: CHANGE\n    # We know that the two doors left include 1 goat and 1 car\n    final_choice_change = ''\n    if choice_initial == 'goat':\n        choice_change = 'car'\n    else:\n        choice_change = 'goat'\n    # When given option: DONT CHANGE\n    choice_nochange = choice_initial\n    # Return binary success integers (1=win, 0=lose)\n    return [(choice_change=='car')*1, (choice_nochange=='car')*1]\ndf = pd.DataFrame(columns=['Change', 'Dont Change'])\nfor i in range(10000):\n    df.loc[len(df)] = simulate_game()\nprint(df.mean())\n```\n"
  },
  {
    "id": 1596844800,
    "title": "Stoicism",
    "author": "Barney",
    "date": "2020-08-08",
    "content": "\n## A Brief History\n\nBefore diving into what Stoicism teaches, let's summarise where it came from. The Stoics were a group of Greek philosophers living around 300 BC, who practised one of the Hellenistic philosophies called Stoicism (another you might have heard of is Epicureanism). Being a Hellenistic philosophy essentially means it was borne out of the Hellenistic period of history in Greece, which was characterised by the dominant spread of Greek culture and philosophical thought across Europe, Africa and Asia. I’m going to refrain from going into too much detail about the individuals behind Stoicism, instead focusing on the ideas. However, there are three that are certainly worth mentioning: Firstly, Marcus Aurelius. Called the “philosopher king”, he was a Roman emperor in the 2nd century AD and known as one of the five great rulers. Secondly there is Lucius Seneca, also known as Seneca the Younger. He was a statesman and adviser who also tutored the famous Nero before he became emperor. Finally, Epictetus. Born as a slave but eventually freed, he used his time to study and preach Stoic philosophy, focussing on practical implementation as opposed to theoretical study. Each of these men has at least one fantastic book worth reading, which I’ll elaborate on toward the end.\n\n## All About Control\n\nNow we know a little about who the Stoic were, let's dive into what they taught.\n\nStoicism looks at the world as follows: There are some things that are within our control, and others that are outside of it. Of the things that are within our control, we can view them as either good, bad or neither good nor bad. Consequently in our opinions and preferences, we should desire what is good, be averse to what is bad, and be indifferent to that which is neither good nor bad. On the other hand there are the things that are not within our control. These things can be neither good nor bad, hence we should be indifferent to anything that happens that is outside our control. Instead, being grateful by desiring whatever outcome occurs. The stoics use the phrase “amor fati” (meaning “to love your fate”) to represent this concept.\n\nSo the instruction is to take action to change the things that you can change so that you achieve more of the good and less of the bad. Meanwhile, be grateful for whatever comes your way if you cannot control it by wanting what you have instead of having what you want.\n\n## The Good, the Bad and the Indifferent\n\nSo that sounds great, but what is the good and what is the bad? What should we desire and what should we avoid? The Stoics had some ideas on that too. Simply put, to achieve the good, an individual must act in accordance with nature. This means performing the role that they should be performing in their current time, place and life. They proposed that a person has many roles at any given time, ranging from the most fundamental to the most specific. The most fundamental role for anyone is that of a human being. The Stoics taught that we are all rational entities, and so in order to act in accordance with nature, we should both think and act in a purely rational manner. Beyond this, we should perform the more specific roles in our life, the meaning of which is best explained via an example. Suppose you are driving your family to the beach for a weekend away (and for simplicity assume I am talking about a man here). What are your roles then? First is the role of human being, requiring you to act and think rationally. Secondly, you are a father, whose role is to educate, love and care for his children. Thirdly you are a husband, and hence should love, respect and support your wife. Beyond this you are also a car driver, whose role is to get everyone in the car to the correct destination (the beach) in a safe and prompt fashion. Now, if you were to successfully do all of these things then you would be acting and thinking in accordance with nature, and this is what the Stoics would define as achieving the good.\n\nThe other side of the coin is the bad. This is largely the opposite of the good as you would expect, meaning any action or thought that is not in accordance with nature. In addition to this, avoidance of the bad involves the avoidance of things such as overindulgence, voluptuary, laziness, dishonour, lack of self control and disloyalty. Hence, to avoid the bad one must act and think in accordance with nature, while simultaneously avoiding instances and temptations of that which is inherently bad.\n\nFinally, many philosophers have concerned themselves with the characteristics of the good, including the famous Aristotle (have a read of Ethics if you are interested in his thoughts). Over time this has lead to an entire branch of philosophical thought on the subject, which in itself could be seamlessly integrated into the Stoic approach.\n\n## Stoicism in the Modern Day\n\nStoicism is clearly an ancient philosophy, otherwise I wouldn’t have needed to provide the little history lesson at the beginning. However, in the last few years the philosophy has grown in modern popularity as a result of modern authors publishing more accessible and readable interpretations than the originals. Take for example Ryan Holiday. I’m going to confess I haven’t read any of his books, but despite this I can clearly see how he has taken these ancient concepts and marketed them to those looking for more meaning or happiness in their lives today. Sadly I can’t yet come to my own conclusion of how close his ideas are to those of the original texts, but if I ever read one of his books, I’ll be sure to update this section to account for it.\n\nSecondly, the concepts of Stoicism that relate to control are some of the earliest observations of a concept that many people know more commonly as that of the locus of control. The idea is that those who focus on what is in their control, and believe that what happens to them is a result of their own actions tend to be more motivated, disciplined and happy in life than those who feel like everything in the world just happens to them. Sounds familiar right? Once again the ancient idea from the Stoics appears to have been re-marketed to fit the modern day world (although I have no evidence that the locus of control theory originated from Stoicism).\n\nFinally, the area of Cognitive Behavioural Therapy is a branch of psychology that focusses on changing physical reactions to situations in the body by changing the thought processes underlying them. I first noticed this link when, during a session of my own, my therapist recommended that I read Meditations by Marcus Aurelius (the Stoic emperor I mentioned during the history lesson). Since then I have noticed many parallels between the two areas, mostly to do with focussing on what is within your control, being grateful for that which is not, and acting in accordance with a set of values that you fully believe in.\n\n## Further Reading\n\nNow let's wrap up. The Stoicism elevator pitch is this: When something is within your control, where you can, act in accordance with your current role well and take action to move yourself toward what is good, meanwhile if something is outside of your control, hold no hopes on the outcome and simply be grateful for what occurs.\n\nIf this sounds like something you’re interested in then there is a limit to how much more I can tell you about it, and as with almost anything, learning the original foundations of the topic will serve you best. Consequently I believe it’s almost always the best move to read the original texts and form your own opinions before you read a modern interpretation of them. Because of this, I would recommend you start off with what I’m going to call the “big three”: Meditations by Marcus Aurelius, Letters from a Stoic by Seneca, and the Discourses and Handbook of Epictetus. These are the three books that I read before writing this, and they offer quite different views of the philosophy given the different backgrounds of each individual.\n"
  },
  {
    "id": 1596326400,
    "title": "Accountability",
    "author": "Barney",
    "date": "2020-08-02",
    "content": "\nAccountability is a subtle but highly effective motivator. It thrives on the social nature of human beings, using our desire for approval to ensure we get tasks done. At its core accountability is about knowing you are responsible for something, be it the health of your child, the profit of your business or the content on your website. The accountability effect is an observation based on this, namely, that we are more motivated and diligent in our actions and thoughts when we know we are accountable for them. My personal thoughts on the reason for the effectiveness of the accountability effect are that it makes us feel important, and this sense of importance (or the fear of losing it) can ensure that we complete tasks we are accountable for.\n\nBefore I go any further it is worth mentioning, despite dealing with the same topic, my discussion of the accountability effect is not based on the book by the same name. The opinions below are my own on the subject, and I have neither read the book nor know what it says about accountability. With that, onto the rest.\n\n## Transferring Accountability\n\nRichard Feynman has a great quote that goes like this: “The first principle is that you must not fool yourself, and you are the easiest person to fool”. Now he meant this largely in relation to the solving of scientific problems, but I think it applies in a wider sense to any opinion we have or action we plan to take. We can all admit at some point to rationalising an action we have taken when we knew at the time it wasn’t right. Common examples of this are “I’ll do a longer workout so I can have the cake” and “I shouldn’t really start studying yet anyway, there’s loads of time”. These arguments work at the time, because we alone are inclined to believe them. However, they don’t stand up to scrutiny when posed to any external counterparty.\n\nBuilding on this, there appear to me to be two main types of accountability, defined by whom we are accountable to. In the first type we are accountable to ourselves (let’s call this “internal accountability”), and in the second we are accountable to others (“external accountability”). In my experience, as well as what I have been reading, external accountability tends to be the stronger of the two, and so we can improve our effectiveness at certain tasks my transferring accountability from ourselves (internal) to somebody else (external). Put simply, this means taking tasks, actions, thoughts and anything else that you have been monitoring yourself and finding someone who you trust that you can make yourself accountable to.\n\nBear this in mind as we look at some examples.\n\n## Examples of Accountability Transfer\n\n### Starting a Blog\n\nIntellectual accountability (relating to your thoughts and opinions) is just as important as physical accountability (relating to your actions). Telling yourself you will learn a new topic or read around a certain area in order to know more about it is great, and personally I find learning new things one of the most satisfying things you can do. However, when left accountable to only ourselves, it can be hard to actually do anything about it, leaving our opinions weak and unstructured, having never had to fight their corner. There are many ways that you can solve this, go to a book club, talk to friends who are also interested in the same things, but one that is all the more common nowadays is to start a blog. This essentially involves airing your views, opinions and thoughts to anyone who happens to come across your site. That was my thinking when I started this blog, both to hold my opinions up to more global scrutiny, and to learn new concepts by explaining them. So, assuming at least one person reads my blog, I have successfully transferred accountability for my thoughts to them, and if nobody does, then fuck it - the world is flat and scientology is cool.\n\n### Dinner party\n\nSecondly, let’s consider transferring accountability for your actions. Suppose you are interested in eating healthier but are struggling with doing so. You have two choices for what to do on Friday night; in the first you tell yourself you are going to cook a healthy meal, holding yourself personally accountable for doing so. In the second you invite your friends around, explicitly telling them that you’re going to cook something containing avocados, vegetables and whatever quinoa is. Now, in which scenario are you more likely to end up cooking that meal? The answer for most people will be the dinner party, as your dinner guests will hold you accountable should they not enjoy a healthy meal on Friday.\n\nAs I mentioned at the beginning, this is a topic that has been researched by those much more intelligent than me, oftentimes under different names. For example, Robert Cialdini talks about something in his book Influence (highly recommended) called “consistency”. This principle states that once people act in a certain way, they feel that other people expect them to continue acting in that way, imploring them to continue doing so in order to appear consistent. Practically speaking, Cialdini is (indirectly) saying that by acting in a certain way you are transferring some accountability for those actions to those around you. This is the same concept however, showing that we can use the transfer of accountability from ourselves to others to improve our motivation and diligence.\n\nGet in touch if you have any thoughts on the above.\n"
  }
]
